{
    "low_range left side": {
        "very firm": [
            "Focus on full range of motion, even on left side.",
            "Focus on the left arm, improve the range of motion.",
            "Focus on full range of motion, left side needs improvement.",
            "Focus on improving left arm range of motion next time.",
            "Maintain full range of motion on the left side."
        ],
        "firm": [
            "Focus on improving left side range, maintain form.",
            "Focus on improving the range on the left side.",
            "Focus on a full range of motion on the left side.",
            "Focus on a complete range of motion on the left side.",
            "Focus on improving left side range of motion."
        ],
        "neutral": [
            "Focus on improving the left side's range of motion.",
            "Focus on improving left side range of motion.",
            "Focus on improving the range of motion on the left side.",
            "Focus on improving left side range next repetition.",
            "Focus on improving the left side's range of motion."
        ],
        "encouraging": [
            "Nice work! Focus on improving left side range next time.",
            "Nice work! Let's focus on full range next time.",
            "Awesome effort! Let's aim for better range next time.",
            "Nice work! Focus on improving left side range next time.",
            "Great job! Let's aim for a higher range next time."
        ],
        "very encouraging": [
            "Awesome job! Let's aim for full range next time!",
            "You're powering through! Let's aim for full range next time!",
            "You've got this! Let's reach for a bigger range!",
            "Great job, keep that energy up!",
            "Awesome work, let's aim for full range next time!"
        ]
    },
    "low_range right side": {
        "very firm": [
            "Focus on right side form for better range.",
            "Focus on full range of motion, push through fatigue.",
            "Focus on full range of motion on the right side.",
            "Improve range on the right side for better results.",
            "Focus on full range of motion on the right side."
        ],
        "firm": [
            "Focus on improving right side's range in bicep curls.",
            "Focus on increasing the range on your right side.",
            "Focus on improving the range of motion on the right side.",
            "Focus on improving right side range.",
            "Focus on improving the range of motion on the right side."
        ],
        "neutral": [
            "Focus on improving the range of motion on the right side.",
            "Focus on improving the range on your right side.",
            "Focus on improving the right side's range of motion.",
            "Focus on improving the range on the right side.",
            "Focus on improving right side range of motion slightly."
        ],
        "encouraging": [
            "Good job! Focus on improving the right side's range.",
            "Fantastic job on the left side, let's match it on right!",
            "Focus on improving the range on the right side.",
            "Great job, focus on improving right side range next time!",
            "Great focus on the left side, aim for equal balance."
        ],
        "very encouraging": [
            "Awesome job! Let's aim for full range next time!",
            "Amazing job! Let's focus on improving that right side!",
            "Great job! Let's focus on extending that right arm more.",
            "Amazing job! Let's aim for a bigger range next time!",
            "You're smashing it! Let's aim for full range next time!"
        ]
    },
    "low_range both sides": {
        "very firm": [
            "Focus on maintaining full range of motion.",
            "Focus on full range of motion, maintain form throughout.",
            "Focus on full range of motion for stronger results.",
            "Improve range of motion, focus on form.",
            "Focus on maintaining full range of motion next time."
        ],
        "firm": [
            "Focus on extending fully for better results.",
            "Focus on full range of motion for each repetition.",
            "Focus on full range of motion for better results.",
            "Focus on maintaining full range of motion next time.",
            "Focus on full range for stronger bicep curls."
        ],
        "neutral": [
            "Focus on improving the range of motion for better results.",
            "Focus on improving range of motion for better results.",
            "Focus on improving your range of motion for better results.",
            "Focus on maintaining a full range of motion.",
            "Maintain full range of motion for better results."
        ],
        "encouraging": [
            "Awesome work! Focus on improving your range next time.",
            "You've got this! Focus on full range next time.",
            "Focus on full range of motion, you're doing great!",
            "Focus on a full range of motion for stronger curls!",
            "Maintain full range of motion for better results!"
        ],
        "very encouraging": [
            "Great job on those bicep curls! Keep up the energy!",
            "Fantastic job! Let's aim for even greater range next time!",
            "Awesome job on those curls! Let's aim for full range!",
            "Fantastic job! Remember to aim for full range next time.",
            "Amazing effort! Let's focus on full range of motion."
        ]
    },
    "bad left side": {
        "very firm": [
            "Focus on keeping both arms in proper form.",
            "Focus on proper form on the left side.",
            "Focus on maintaining proper form on the left side.",
            "Fix the left arm form, focus on technique.",
            "Focus on maintaining proper form on both sides next time."
        ],
        "firm": [
            "Focus on keeping both arms in proper form.",
            "Focus on proper form, keep both sides even.",
            "Focus on keeping both arms in proper form.",
            "Focus on keeping both arms in proper form.",
            "Focus on maintaining proper form on the left side."
        ],
        "neutral": [
            "Focus on maintaining consistent form on both sides.",
            "Focus on maintaining even form on both sides.",
            "Focus on keeping both arms in proper form.",
            "Focus on maintaining good form on both sides.",
            "Focus on balancing both sides for better symmetry."
        ],
        "encouraging": [
            "Awesome work on the right side, focus on form!",
            "Great job with those bicep curls, focus on left side!",
            "Focus on maintaining good form on both sides. Keep it up!",
            "Great job on the right side, keep it up!",
            "Great job with the right side, let's focus on balance!"
        ],
        "very encouraging": [
            "You're a rockstar! Let's nail that left side next!",
            "Fantastic job! Let's focus on form next time.",
            "Awesome work! Let's focus on form for a moment.",
            "You're crushing it! Let's maintain that awesome form!",
            "Amazing job! Let's focus on keeping both sides strong."
        ]
    },
    "bad right side": {
        "very firm": [
            "Focus on maintaining proper form on the right side.",
            "Focus on improving the form on your right side now.",
            "Focus on proper form, especially on the right side.",
            "Focus on keeping both sides in proper form.",
            "Focus on maintaining proper form on your right side."
        ],
        "firm": [
            "Focus on maintaining proper form on the right side.",
            "Focus on proper form on the right side.",
            "Focus on maintaining proper form on the right side.",
            "Focus on keeping both arms moving together to prevent imbalance.",
            "Focus on maintaining proper form on the right side."
        ],
        "neutral": [
            "Focus on maintaining equal form on both sides next time.",
            "Focus on maintaining form on both sides during curls.",
            "Focus on maintaining even form on both sides.",
            "Focus on maintaining proper form on both sides.",
            "Focus on maintaining symmetry between both arms."
        ],
        "encouraging": [
            "Awesome work with the left side! Maintaining that form!",
            "Great job focusing on your left side, keep it up!",
            "Great job on the left side! Let's focus on form.",
            "Nice work on the left side, let's match that form!",
            "Great job on the left side, let's match that on the right!"
        ],
        "very encouraging": [
            "Amazing effort! Let's focus on keeping both sides strong!",
            "You're doing fantastic! Let's focus on that right side.",
            "Amazing job! Let's make the next rep even better!",
            "You're crushing it! Let's focus on that right side!",
            "Fantastic work! Let's focus on form for next set."
        ]
    },
    "bad both sides": {
        "very firm": [
            "Focus on proper form for better results.",
            "Focus on maintaining proper form on every repetition.",
            "Focus on maintaining proper form for better results.",
            "Focus on form, tighten your core for better stability.",
            "Focus on your form for the next set, tighten up!"
        ],
        "firm": [
            "Focus on maintaining proper form for effective bicep gains.",
            "Focus on keeping good form on both sides.",
            "Focus on maintaining proper form for better muscle engagement.",
            "Focus on maintaining proper form on each repetition.",
            "Focus on form for better bicep curls next time."
        ],
        "neutral": [
            "Focus on maintaining proper form for better results.",
            "Focus on maintaining proper form for better results.",
            "Focus on maintaining good form to prevent injury.",
            "Focus on maintaining proper form throughout the bicep curls.",
            "Focus on maintaining proper form for both arms."
        ],
        "encouraging": [
            "Great work, let's focus on improving form next time!",
            "Great job, focus on form for the next set!",
            "Focus on maintaining proper form for better results.",
            "Good job on those bicep curls! You got this!",
            "Great job, focus on your form for better results!"
        ],
        "very encouraging": [
            "You're a rockstar! Let's focus on form next time.",
            "Amazing effort! Let's focus on form for better results!",
            "Amazing effort! Let's focus on perfecting the form next time!",
            "Awesome work! Let's focus on form for next reps!",
            "Keep up the positivity! You're doing fantastic!"
        ]
    },
    "corrected low_range left side": {
        "very firm": [
            "Focus on full range of motion for left arm.",
            "Focus on maintaining full range of motion on both sides.",
            "Focus on maintaining full range of motion on both sides.",
            "Engage left bicep fully for complete range of motion.",
            "Focus on maintaining full range on the left side."
        ],
        "firm": [
            "Focus on maintaining full range of motion on both sides.",
            "Focus on maintaining full range of motion on your left side.",
            "Focus on maintaining full range of motion on both sides.",
            "Focus on maintaining full range of motion on both sides.",
            "Focus on full range of motion for left bicep curl."
        ],
        "neutral": [
            "Focus on extending the range equally on both sides.",
            "Focus on symmetrical range of motion for each arm.",
            "Focus on maintaining proper range of motion on both sides.",
            "Focus on maintaining consistent range of motion on both sides.",
            "Focus on maintaining consistent range of motion on both sides."
        ],
        "encouraging": [
            "Well done on fixing the range, keep up the good work!",
            "Maintain that excellent form, focus on full range of motion!",
            "Well done! Focus on maintaining full range of motion.",
            "Well done on correcting the range of motion! Great job!",
            "Maintain that great form, you're on fire today!"
        ],
        "very encouraging": [
            "Amazing job! Let's aim for full range next time!",
            "You're crushing it! Let's aim for full range next.",
            "Fantastic work! Full range on both sides, you're unstoppable!",
            "You're crushing it, keep that energy up!",
            "Awesome job! Keep that energy going!"
        ]
    },
    "corrected low_range right side": {
        "very firm": [
            "Focus on full range of motion for each repetition.",
            "Ensure full range of motion on both sides.",
            "Focus on full range, engage right bicep fully.",
            "Focus on full range of motion, no shortcuts.",
            "Focus on full range of motion for better results."
        ],
        "firm": [
            "Focus on full range of motion on the right side.",
            "Focus on full range of motion, stay consistent.",
            "Focus on full range of motion for stronger bicep activation.",
            "Focus on full range of motion for better results.",
            "Focus on full range on the right side for accuracy."
        ],
        "neutral": [
            "Focus on maintaining consistent range of motion on both sides.",
            "Focus on maintaining consistent range of motion on both sides.",
            "Focus on maintaining full range of motion on both sides.",
            "Focus on maintaining full range of motion on both sides.",
            "Focus on maintaining consistent range of motion on both sides."
        ],
        "encouraging": [
            "Fantastic job! Focus on full range of motion next.",
            "Fantastic job! Keep up the strong effort!",
            "Awesome work! Maintain that full range of motion.",
            "Awesome job with that correction! Keep up the good work!",
            "Maintain that strong form, you're on the right track!"
        ],
        "very encouraging": [
            "Fantastic job pushing through with energy and focus!",
            "You're doing fantastic, keep up the amazing work!",
            "Awesome job! Let's aim for full range next time!",
            "Fantastic work! Let's aim for perfect form next time!",
            "Fantastic job! Keep that energy up!"
        ]
    },
    "corrected low_range both sides": {
        "very firm": [
            "Maintain full range of motion on both sides.",
            "Full range of motion is crucial for maximum benefit.",
            "Focus on full range for optimal results.",
            "Focus on full range of motion for maximum benefit.",
            "Focus on full range of motion for each curl."
        ],
        "firm": [
            "Focus on full range of motion for each rep.",
            "Focus on full range of motion for better results.",
            "Maintain full range of motion on both sides.",
            "Focus on full range of motion for optimal results.",
            "Focus on full range of motion for better results."
        ],
        "neutral": [
            "Focus on maintaining consistent range of motion on both sides.",
            "Focus on maintaining full range of motion on every repetition.",
            "Focus on maintaining proper form for full range of motion.",
            "Focus on maintaining consistent range of motion on both sides.",
            "Maintain consistent full range of motion for better results."
        ],
        "encouraging": [
            "Keep up the good work, you're getting stronger each repetition!",
            "Maintain full range of motion for maximum benefit.",
            "You're doing fantastic, keep up the good work!",
            "Nice correction on the range of motion! Keep it up!",
            "Good job, aim for full range next time!"
        ],
        "very encouraging": [
            "Amazing effort! Let's continue with full range of motion!",
            "Fantastic job on maintaining full range of motion! Keep it up!",
            "Amazing job correcting the range! Keep up the energy!",
            "You're crushing these bicep curls, keep up the amazing work!",
            "Awesome work! Maintain that full range of motion!"
        ]
    },
    "corrected bad right side": {
        "very firm": [
            "Correct left arm form immediately to prevent injury.",
            "Focus on keeping the left elbow close to your body.",
            "Focus on maintaining proper form on the left side.",
            "Focus on maintaining proper form throughout each repetition.",
            "Focus on keeping your left elbow stable throughout the curl."
        ],
        "firm": [
            "Keep the left elbow close to your body for better form.",
            "Focus on keeping the left elbow steady and aligned.",
            "Correct the form on the left side for full range.",
            "Focus on maintaining proper form on the left side.",
            "Focus on maintaining proper form throughout the entire set."
        ],
        "neutral": [
            "Focus on keeping both arms aligned throughout the movement.",
            "Focus on maintaining proper form for balanced muscle engagement.",
            "Focus on keeping both elbows close to your sides.",
            "Focus on maintaining proper form for both sides.",
            "Keep your back straight to protect your spine."
        ],
        "encouraging": [
            "Nice correction! Your form is looking better each rep.",
            "Fantastic correction on your left side, keep up the good work!",
            "Great job on correcting your form, you're getting stronger!",
            "Nice correction on the left side, keep up the good work!",
            "Amazing job correcting your form on the left side!"
        ],
        "very encouraging": [
            "Amazing correction on your left side! Keep up the energy!",
            "You're really nailing those bicep curls! Great job!",
            "Awesome job correcting your form, keep up the amazing work!",
            "Amazing job correcting your form on the left side!",
            "You're crushing those bicep curls! Keep up the fantastic work!"
        ]
    },
    "corrected bad left side": {
        "very firm": [
            "Focus on keeping your right elbow stable and in alignment.",
            "Focus on maintaining proper form on both sides.",
            "Focus on keeping your right arm close to your body.",
            "Focus on maintaining proper form on both sides next time.",
            "Focus on keeping your elbow still for better form."
        ],
        "firm": [
            "Focus on maintaining proper form throughout the entire exercise.",
            "Focus on stabilizing your right elbow for better form.",
            "Focus on maintaining good form throughout the entire movement.",
            "Focus on keeping your right elbow close to your body.",
            "Focus on maintaining proper form on the right side."
        ],
        "neutral": [
            "Focus on both sides for a balanced range of motion.",
            "Ensure both sides maintain proper form.",
            "Focus on maintaining proper form throughout each repetition.",
            "Focus on maintaining proper form throughout the exercise.",
            "Focus on maintaining proper form throughout the exercise."
        ],
        "encouraging": [
            "Nice correction on form, keep up the good work!",
            "Great job correcting your form on the right side!",
            "You corrected the form well, keep up the good work!",
            "Nice correction on the right side, keep up the good work!",
            "Fantastic job improving form on the right side, keep it up!"
        ],
        "very encouraging": [
            "Fantastic correction! Your determination is inspiring.",
            "Superb job correcting your form on the last repetition!",
            "Fantastic job correcting your form on the right side!",
            "Fantastic correction on form, keep up the amazing work!",
            "Awesome job! Let's keep those bicep curls going strong!"
        ]
    },
    "corrected bad both sides": {
        "very firm": [
            "Focus on maintaining proper form throughout the entire movement.",
            "Focus on engaging your core to maintain proper form.",
            "Focus on keeping your elbows close to your body.",
            "Focus on keeping your elbows stable throughout the curls.",
            "Correct both arms' form immediately, maintain good alignment."
        ],
        "firm": [
            "Focus on maintaining proper form throughout the movement.",
            "Focus on maintaining proper form throughout the entire movement.",
            "Focus on keeping your elbows close to your body.",
            "Focus on keeping your elbows stable throughout the movement.",
            "Focus on maintaining proper form for better muscle engagement."
        ],
        "neutral": [
            "Stay focused on maintaining proper form for each repetition.",
            "Focus on maintaining good form throughout all repetitions.",
            "Focus on maintaining proper form throughout the exercise.",
            "Focus on maintaining proper form throughout each repetition.",
            "Maintain consistent form on both sides for better results."
        ],
        "encouraging": [
            "Great job fixing your form, keep up the good work!",
            "Fantastic job on those bicep curls, keep up the energy!",
            "Great job correcting the form, keep up the good work!",
            "Awesome work! Focus on maintaining proper form throughout.",
            "Great job catching those form mistakes, keep up the good work!"
        ],
        "very encouraging": [
            "You're nailing those bicep curls, keep up the amazing work!",
            "You're crushing those curls! Keep up the amazing work!",
            "Excellent job on correcting your form, keep up the energy!",
            "Awesome job improving your form, keep up the fantastic work!",
            "Fantastic job! You're improving with each rep!"
        ]
    },
    "good form": {
        "very firm": [
            "Focus on maintaining proper form throughout all repetitions.",
            "Focus on maintaining proper form throughout the entire set.",
            "Engage your core to stabilize your body during the curls.",
            "Focus on maintaining proper form throughout all repetitions.",
            "Maintain proper form, focus on muscle engagement."
        ],
        "firm": [
            "Focus on maintaining proper elbow alignment throughout the exercise.",
            "Focus on maintaining proper form throughout the exercise.",
            "Maintain proper form throughout the entire set.",
            "Focus on maintaining proper form throughout the entire set.",
            "Stay focused on your form, maintain proper wrist position."
        ],
        "neutral": [
            "Maintain consistent form throughout your next set.",
            "Maintain your form and continue with the bicep curls.",
            "Maintain consistency in your form throughout the exercise.",
            "Maintain the same form for all repetitions.",
            "Maintain consistent form throughout the entire set."
        ],
        "encouraging": [
            "You're crushing those bicep curls! Keep up the good work!",
            "Fantastic job! Keep up the excellent work!",
            "Awesome job! You've got this, keep it up!",
            "You're rocking those bicep curls, keep up the fantastic work!",
            "Fantastic job, keep up the strong curls!"
        ],
        "very encouraging": [
            "You're crushing those curls! Keep up the amazing work!",
            "You're crushing those bicep curls! Keep up the fantastic work!",
            "You're killing it! One more rep, you got this!",
            "Awesome job with those bicep curls! Keep up the energy!",
            "Fantastic job on those bicep curls, keep up the energy!"
        ]
    },
    "high_range left side": {
        "very firm": [
            "Control the range on your left side, focus on form.",
            "Control the left arm, maintain proper range next time.",
            "Control the range of motion in your left arm.",
            "Control left arm to improve range of motion.",
            "Control the left arm to maintain proper range of motion."
        ],
        "firm": [
            "Focus on maintaining proper form, control range of motion.",
            "Control the range of motion, focus on form.",
            "Control the range of motion on your left side.",
            "Focus on maintaining proper form to prevent injury.",
            "Focus on maintaining proper form to prevent injury."
        ],
        "neutral": [
            "Focus on maintaining consistent range of motion on both sides.",
            "Maintain a consistent range of motion on both sides.",
            "Focus on maintaining consistent range of motion on both sides.",
            "Focus on maintaining consistent range of motion on both sides.",
            "Focus on maintaining consistent range of motion in each repetition."
        ],
        "encouraging": [
            "Great job on that last rep, focus on form next!",
            "Nice work, focus on maintaining proper form next time.",
            "Awesome effort! Let's focus on maintaining a consistent range.",
            "Fantastic work! Focus on improving left side range.",
            "Nice work, focus on full range of motion next time!"
        ],
        "very encouraging": [
            "Awesome job pushing through! Let's focus on form next.",
            "You're crushing it! Let's maintain that strong form!",
            "Awesome job on that last repetition, keep up the energy!",
            "You're doing amazing! Let's focus on form next!",
            "You're crushing it! Let's aim for even more control."
        ]
    },
    "high_range right side": {
        "very firm": [
            "Focus on proper form for better results.",
            "Control the movement on your right side, focus on form.",
            "Focus on maintaining proper form for better results.",
            "Control the range on the right side, focus on form.",
            "Focus on maintaining control for better form next time."
        ],
        "firm": [
            "Focus on controlling the movement for better form.",
            "Maintain proper form with controlled range of motion.",
            "Control the range of motion for better form.",
            "Control the movement to maintain proper range of motion.",
            "Focus on maintaining proper range of motion next time."
        ],
        "neutral": [
            "Focus on maintaining consistent range of motion on both sides.",
            "Focus on maintaining a consistent range of motion on both sides.",
            "Focus on maintaining a consistent range of motion.",
            "Focus on keeping the range consistent on both sides.",
            "Focus on maintaining a consistent range of motion."
        ],
        "encouraging": [
            "Nice work! Focus on controlled movements for better form.",
            "Focus on maintaining a controlled range of motion.",
            "Nice work on the bicep curls! Focus on control next time.",
            "Nice work! Focus on maintaining proper form next time.",
            "Focus on maintaining a controlled range of motion. Well done!"
        ],
        "very encouraging": [
            "You're on fire! Let's focus on form for balance.",
            "You're crushing it! Focus on form for next rep.",
            "You're almost there, keep up the fantastic work!",
            "You're showing amazing dedication and energy, keep it up!",
            "Fantastic job! Let's aim for perfect form next time!"
        ]
    },
    "high_range both sides": {
        "very firm": [
            "Focus on controlled range for better form.",
            "Maintain proper form through the entire range next time.",
            "Focus on controlling the range of motion more precisely.",
            "Too much range, control your movements for better form.",
            "Focus on maintaining proper form for better results."
        ],
        "firm": [
            "Focus on maintaining proper form for better results.",
            "Control the range of motion to prevent overextension.",
            "Control your range of motion for better form.",
            "Focus on maintaining proper range of motion next time.",
            "Control the range of motion for better form."
        ],
        "neutral": [
            "Focus on maintaining a steady range of motion.",
            "Focus on maintaining a consistent range of motion.",
            "Focus on maintaining a controlled range of motion.",
            "Ensure controlled movement for better form.",
            "Focus on maintaining a controlled range of motion."
        ],
        "encouraging": [
            "Awesome energy! Focus on controlled, smaller range of motion.",
            "Maintain control and focus on form for better range.",
            "Maintain control to improve range of motion.",
            "You're doing great, focus on maintaining form for control.",
            "Awesome work, let's focus on keeping a controlled motion!"
        ],
        "very encouraging": [
            "Fantastic energy! Let's focus on form for next rep.",
            "You're crushing it! Push for that full range!",
            "You're crushing it! Maintain that energy and perfect form!",
            "Fantastic job with those bicep curls! Keep up the energy!",
            "Keep up the amazing work, push through with positivity!"
        ]
    },
    "corrected high_range left side": {
        "very firm": [
            "Maintain proper form, focus on symmetry, increase range.",
            "Control your left arm to maintain proper range next time.",
            "Focus on maintaining proper form for both sides.",
            "Focus on maintaining proper range of motion on both sides.",
            "Focus on maintaining proper range on both sides."
        ],
        "firm": [
            "Focus on maintaining a consistent range of motion.",
            "Maintain proper form and focus on balanced range of motion.",
            "Maintain equal range on both sides for better balance.",
            "Focus on maintaining consistent range of motion on both sides.",
            "Maintain proper form with controlled movement."
        ],
        "neutral": [
            "Focus on maintaining consistent range of motion.",
            "Focus on maintaining consistent range of motion on both sides.",
            "Maintain equal range of motion on both sides.",
            "Focus on maintaining consistent range on both sides.",
            "Maintain consistent range of motion on both sides."
        ],
        "encouraging": [
            "Fantastic job correcting the range of motion on the left!",
            "Fantastic job correcting that left side range, keep it up!",
            "Fantastic work! Maintain that range of motion on both sides.",
            "You're doing great with those bicep curls, keep it up!",
            "Well done! Maintain that movement pattern for best results."
        ],
        "very encouraging": [
            "Amazing job! Your form is improving with each rep!",
            "Amazing job! You're making great progress.",
            "Amazing job! You're crushing those bicep curls today!",
            "Terrific job on correcting the range of motion, keep it up!",
            "Awesome job on the corrected range of motion, keep it up!"
        ]
    },
    "corrected high_range right side": {
        "very firm": [
            "Maintain proper form to avoid shoulder strain.",
            "Focus on maintaining proper form for controlled movement.",
            "Focus on maintaining proper form throughout the entire movement.",
            "Maintain proper range of motion on both sides.",
            "Focus on maintaining proper form for better results."
        ],
        "firm": [
            "Maintain proper form for balanced range of motion.",
            "Focus on maintaining the correct range of motion.",
            "Focus on maintaining proper form for both arms.",
            "Concentrate on keeping both arms at equal range.",
            "Focus on maintaining the correct range of motion on both sides."
        ],
        "neutral": [
            "Focus on maintaining consistent range of motion on both sides.",
            "Focus on maintaining consistent range of motion on both sides.",
            "Focus on maintaining equal range of motion on both sides.",
            "Focus on maintaining consistent range of motion on both sides.",
            "Maintain consistent range of motion on both sides."
        ],
        "encouraging": [
            "Nice correction on the right side, keep up the energy!",
            "Awesome job! Focus on maintaining symmetrical range.",
            "Fantastic job on correcting the mistake, keep up the energy!",
            "Fantastic! Remember to maintain equal range on both sides.",
            "Awesome job improving the range on the right side!"
        ],
        "very encouraging": [
            "You're nailing those bicep curls, keep up the amazing work!",
            "Fantastic job on that correction, you're crushing it!",
            "Amazing job! Your form is excellent, keep it up!",
            "You're crushing those bicep curls! Keep up the fantastic work!",
            "Fantastic job! Your dedication is paying off beautifully."
        ]
    },
    "corrected high_range both sides": {
        "very firm": [
            "Maintain proper form to prevent injury.",
            "Maintain proper form, focus on full range of motion.",
            "Maintain proper form and focus on full range of motion.",
            "Focus on maintaining proper form for better results.",
            "Maintain proper form for maximum benefit and safety."
        ],
        "firm": [
            "Focus on maintaining consistent range of motion on each rep.",
            "Focus on maintaining the correct range of motion.",
            "Focus on maintaining proper form throughout the entire movement.",
            "Maintain proper form for better results.",
            "Maintain consistent range throughout the exercise."
        ],
        "neutral": [
            "Stay focused on maintaining consistent range of motion.",
            "Focus on maintaining consistent range of motion.",
            "Focus on maintaining consistent range of motion on both sides.",
            "Maintain the range of motion consistency for each repetition.",
            "Maintain consistent range of motion on both sides."
        ],
        "encouraging": [
            "You're showing great progress! Keep up the good work!",
            "You're doing fantastic with those bicep curls, keep it up!",
            "Excellent job correcting your range of motion on both sides!",
            "Fantastic job maintaining proper form, keep up the good work!",
            "Fantastic job on fixing the range of motion, keep it up!"
        ],
        "very encouraging": [
            "You corrected the range perfectly! Keep up the energy!",
            "Awesome job adjusting the range, keep up the energy!",
            "Fantastic job on those bicep curls, keep up the amazing work!",
            "Fantastic job on those bicep curls, you're killing it!",
            "You're crushing those bicep curls, keep up the amazing work!"
        ]
    },
    "fast": {
        "very firm": [
            "Pick up the pace on the next repetition.",
            "Pick up the pace and maintain proper form for bicep curls.",
            "Speed up the curl, maintain proper form.",
            "Speed up the last few reps for better form.",
            "Pick up the pace on the bicep curls, increase intensity."
        ],
        "firm": [
            "Pick up the pace on the bicep curls to improve.",
            "Maintain a steady pace throughout each repetition.",
            "Pick up the pace for better muscle engagement.",
            "Focus on maintaining a consistent speed throughout the exercise.",
            "Focus on maintaining a consistent speed throughout each repetition."
        ],
        "neutral": [
            "Maintain a consistent speed throughout all repetitions.",
            "Maintain a consistent pace to optimize form and efficiency.",
            "Maintain a consistent speed throughout each repetition.",
            "Maintain consistent speed throughout all repetitions, focus on form.",
            "Focus on maintaining a consistent pace throughout the exercise."
        ],
        "encouraging": [
            "Stay focused, maintain a steady pace for best results.",
            "You're strong! Let's maintain a steady pace throughout.",
            "Stay focused and maintain a steady pace for each curl.",
            "You've got this! Let's add a bit more speed.",
            "You're doing great, let's pick up the pace a bit!"
        ],
        "very encouraging": [
            "You're doing fantastic, keep up the amazing work!",
            "Awesome job! Let's keep up the fantastic work!",
            "Keep up the great work! Show those biceps who's boss!",
            "Fantastic job! Let's power through with perfect form!",
            "Fantastic work! Let's try to speed up a bit more."
        ]
    },
    "slow": {
        "very firm": [
            "Control the speed, maintain form for effective bicep curls.",
            "Control the speed for better form.",
            "Control the speed of your repetitions for better form.",
            "Control your speed for proper form and full benefit.",
            "Control the speed for better form and muscle activation."
        ],
        "firm": [
            "Control the speed for better form on bicep curls.",
            "Control the speed of your bicep curls for proper form.",
            "Control the speed to maintain proper form throughout the exercise.",
            "Control the speed of each repetition for better effectiveness.",
            "Control the speed for better form and muscle engagement."
        ],
        "neutral": [
            "Control the speed of your bicep curls for better form.",
            "Maintain a consistent tempo for effective muscle engagement.",
            "Maintain a consistent pace throughout each repetition.",
            "Maintain a steady pace for better form.",
            "Control the speed of your movements for better form."
        ],
        "encouraging": [
            "Nice work, keep focusing on that form!",
            "You're showing great determination and strength throughout the exercise!",
            "Nice job on those bicep curls, keep up the pace!",
            "Nice job, maintain control and pace for better form!",
            "Smooth out the speed, focus on form. Great job!"
        ],
        "very encouraging": [
            "Nice work! Let's keep up the fantastic effort!",
            "Wow, you're crushing those curls! Keep up the energy!",
            "Fantastic work! Maintain control for optimal results.",
            "Amazing work! Control the speed for better results.",
            "Amazing job! Your energy is fantastic today!"
        ]
    },
    "corrected fast": {
        "very firm": [
            "Control the movement to prevent rushing the curl.",
            "Control your speed for better form.",
            "Control the movement to maintain proper form.",
            "Control the speed, focus on form for better results.",
            "Control the speed, focus on form for better results."
        ],
        "firm": [
            "Control your pace for better form and effectiveness.",
            "Control the speed to maintain proper form.",
            "Control the pace, focus on form for better results.",
            "Slow down the movement to maintain proper form.",
            "Control the speed, maintain proper form throughout each rep."
        ],
        "neutral": [
            "Maintain a steady pace throughout the exercise.",
            "Focus on maintaining a steady pace for better control.",
            "Maintain consistent speed throughout the bicep curls.",
            "Focus on maintaining a steady pace for proper form.",
            "Focus on maintaining a consistent pace with each repetition."
        ],
        "encouraging": [
            "Great job with your form, keep up the good work!",
            "Nice job correcting your speed, keep up the good work!",
            "You're doing great, keep up the good work!",
            "Nice job on that last rep! Keep up the good work!",
            "Awesome job! Keep up the good work!"
        ],
        "very encouraging": [
            "Awesome job with those bicep curls, keep up the momentum!",
            "Fantastic job on those bicep curls, you're crushing it!",
            "You're doing fantastic! Keep up the excellent work!",
            "You're doing fantastic, keep up the amazing work!",
            "Amazing job! Your form is on point today!"
        ]
    },
    "corrected slow": {
        "very firm": [
            "Speed up the curl to improve form and muscle engagement.",
            "Speed up the movement for better results.",
            "Speed up the curl movement, maintain a steady pace.",
            "Speed up the movement to maintain proper form.",
            "Pick up the pace and maintain proper form."
        ],
        "firm": [
            "Speed up the movement, maintain control.",
            "Pick up the pace to maintain proper form.",
            "Pick up the pace slightly for better form and control.",
            "Pick up the pace a bit for better results.",
            "Speed up the movement for proper form and efficiency."
        ],
        "neutral": [
            "Focus on maintaining a moderate tempo throughout the movement.",
            "Maintain a steady pace throughout each repetition.",
            "Maintain a consistent pace for better form.",
            "Maintain a steady pace throughout the next repetitions.",
            "Maintain a consistent pace throughout the exercise."
        ],
        "encouraging": [
            "You're doing great, keep up the good work!",
            "You're making great progress with those bicep curls, keep it up!",
            "You've got this! Maintain good form and pace.",
            "You're looking strong today, keep up the good work!",
            "Keep up the great pace, you're doing fantastic!"
        ],
        "very encouraging": [
            "You're crushing these bicep curls, keep up the fantastic work!",
            "Fantastic job on those bicep curls, you're crushing it!",
            "You're powering through those curls, amazing energy today!",
            "You're crushing it today, keep up the fantastic work!",
            "Fantastic job on those bicep curls, you're crushing it!"
        ]
    },
    "good speed": {
        "very firm": [
            "Maintain proper form to prevent injury.",
            "Maintain proper form to prevent any potential injuries.",
            "Maintain proper form for optimal results.",
            "Focus on maintaining proper form to prevent injury.",
            "Focus on maintaining proper form for safety and effectiveness."
        ],
        "firm": [
            "Maintain proper form to prevent shoulder strain.",
            "Focus on keeping your core stable during each curl.",
            "Maintain proper form to maximize effectiveness.",
            "Focus on maintaining proper form.",
            "Maintain proper form, focus on controlled movements."
        ],
        "neutral": [
            "Maintain good form and control throughout each repetition.",
            "Maintain proper form and continue at this pace.",
            "Continue with good speed and form, maintaining control.",
            "Maintain proper form to avoid injury and optimize results.",
            "Maintain proper form to prevent injury."
        ],
        "encouraging": [
            "Well done! Your form is looking really good today.",
            "You're doing great, keep up the good work!",
            "Excellent job! Keep up the strong pace!",
            "You're looking strong and focused, keep up the good work!",
            "Fantastic job! You've got great strength and form today!"
        ],
        "very encouraging": [
            "Fantastic job! You're crushing those bicep curls!",
            "Fantastic work! You've got this!",
            "Fantastic job, your form is spot on today!",
            "You're crushing those bicep curls, keep up the fantastic work!",
            "Fantastic job! You're powering through those bicep curls!"
        ]
    }
}