{
    "low_range left side": {
        "very firm": [
            "Focus on maintaining full range of motion on the left.",
            "Focus on improving left side range. Fix form.",
            "Improve left side range, focus on form despite fatigue.",
            "Focus on improving left side range, maintain form rigorously.",
            "Focus on full range of motion even when tired."
        ],
        "firm": [
            "Focus on improving left side range of motion.",
            "Focus on full range of motion on the left side.",
            "Focus on improving left side range of motion.",
            "Focus on improving left side's range despite fatigue.",
            "Focus on increasing range on the left side."
        ],
        "neutral": [
            "Focus on maintaining consistent range of motion on both sides.",
            "Focus on improving left side range. You're doing good overall.",
            "Focus on improving left side's range next set.",
            "Focus on maintaining good form on both sides.",
            "Focus on maintaining consistent range of motion on both sides."
        ],
        "encouraging": [
            "Good job pushing through, focus on left side range.",
            "Focus on maintaining full range of motion next time.",
            "Great work! Focus on full range for left bicep curl.",
            "Well done overall, focus on left side range next time.",
            "Focus on maintaining full range of motion, you're doing great!"
        ],
        "very encouraging": [
            "Amazing effort! Focus on keeping the left side consistent.",
            "Awesome job, let's focus on improving the left side!",
            "Amazing effort! Let's focus on a full range next time.",
            "Amazing work! Focus on full range with left arm next.",
            "Awesome job! Let's aim for full range next time."
        ]
    },
    "low_range right side": {
        "very firm": [
            "Focus on full range of motion on the right side.",
            "Focus on full range, even when fatigued.",
            "Focus on full range. Keep pushing through the fatigue.",
            "Focus on full range of motion. Rest properly.",
            "Focus on extending the right arm fully next time."
        ],
        "firm": [
            "Focus on improving the range on the right side.",
            "Focus on right side range, maintain form throughout.",
            "Focus on full range of motion, especially on the right side.",
            "Focus on improving right side range. Keep pushing through.",
            "Focus on improving right side range of motion."
        ],
        "neutral": [
            "Focus on maintaining consistent range of motion on both sides.",
            "Focus on improving the range of motion on the right side.",
            "Maintain proper form for balanced muscle engagement.",
            "Focus on maintaining consistent range of motion on both sides.",
            "Focus on maintaining consistent range of motion on both sides."
        ],
        "encouraging": [
            "Good job! Focus on improving range next time.",
            "You're doing great, focus on full range next time!",
            "Great job, focus on maintaining form on the right side!",
            "Great job, focus on maintaining that form!",
            "Great form on the left side, focus on the right!"
        ],
        "very encouraging": [
            "Awesome job overall! Let's focus on that right side.",
            "Awesome job! Focus on full range for even better results.",
            "Amazing work! Let's push through the fatigue together!",
            "Awesome work! Focus on extending the right arm fully.",
            "Amazing job! Let's focus on full range next time."
        ]
    },
    "low_range both sides": {
        "very firm": [
            "Focus on improving your range of motion, push through fatigue.",
            "Focus on maintaining proper form despite fatigue.",
            "Focus on maintaining full range even when tired.",
            "Focus on full range of motion to prevent injury.",
            "Focus on full range for better results."
        ],
        "firm": [
            "Focus on improving the range of motion for better results.",
            "Focus on full range of motion for better results.",
            "Focus on maintaining full range of motion with each repetition.",
            "Focus on maintaining full range of motion for better results.",
            "Maintain proper form for better range next time."
        ],
        "neutral": [
            "Focus on maintaining full range of motion next time.",
            "Focus on maintaining full range of motion next time.",
            "Focus on improving your range of motion next rep.",
            "Focus on maintaining full range of motion for each repetition.",
            "Focus on maintaining full range of motion next time."
        ],
        "encouraging": [
            "Good job pushing through, focus on full range next time!",
            "You're doing great, just focus on that full range!",
            "You're doing great, just a little more range next time!",
            "Fantastic work! Let's aim for a fuller range next time.",
            "You're doing great, just focus on that full range!"
        ],
        "very encouraging": [
            "You're doing great! Let's aim for full range next time.",
            "You're doing amazing! Push through, you've got this!",
            "Amazing work - push through, you're almost there!",
            "Amazing effort! Remember to focus on full range of motion.",
            "Awesome work! Let's focus on that range next time!"
        ]
    },
    "bad left side": {
        "very firm": [
            "Focus on maintaining proper form on both sides.",
            "Focus on keeping both arms aligned throughout the movement.",
            "Focus on maintaining proper form, even when fatigued.",
            "Focus on maintaining proper form on both sides next time.",
            "Focus on maintaining proper form on the left side now."
        ],
        "firm": [
            "Focus on maintaining proper form on the left side.",
            "Focus on maintaining proper form on the left side.",
            "Correct your left form, ensure equal effort on both sides.",
            "Focus on maintaining proper form, especially on the left side.",
            "Focus on maintaining proper form on both sides despite fatigue."
        ],
        "neutral": [
            "Focus on maintaining even form on both sides next time.",
            "Focus on maintaining equal form on both sides next time.",
            "Focus on maintaining proper form on both sides next time.",
            "Focus on maintaining proper form on both sides.",
            "Focus on keeping both sides in good form, watch fatigue."
        ],
        "encouraging": [
            "Great job, focus on keeping equal form on both sides.",
            "Great job, focus on maintaining form and take a break.",
            "You're doing great, focus on keeping both sides even!",
            "Well done! Focus on maintaining form on the left side.",
            "Awesome job! Keep pushing through, you're almost there!"
        ],
        "very encouraging": [
            "You're a rockstar! Let's aim for even better form!",
            "Fantastic work overall! Let's focus on form next time.",
            "You're crushing it! Just a bit more on the left!",
            "Amazing job! You're a rockstar, keep pushing through!",
            "You're almost there, keep pushing through the fatigue!"
        ]
    },
    "bad right side": {
        "very firm": [
            "Focus on maintaining form especially on the right side.",
            "Focus on maintaining proper form on both sides.",
            "Focus on maintaining proper form on the right side.",
            "Focus on proper form even when fatigued.",
            "Focus on maintaining proper form on both sides."
        ],
        "firm": [
            "Focus on maintaining proper form on both sides.",
            "Focus on maintaining form on the right side.",
            "Focus on maintaining proper form on both sides.",
            "Focus on maintaining proper form on the right side.",
            "Focus on maintaining proper form on the right side."
        ],
        "neutral": [
            "Focus on maintaining proper form to prevent injury.",
            "Focus on maintaining good form on both sides next time.",
            "Focus on maintaining consistent form on both sides.",
            "Focus on maintaining proper form on both sides.",
            "Focus on maintaining form on both sides."
        ],
        "encouraging": [
            "You're maintaining good form on the left side, great job!",
            "Well done on maintaining good form on the left side!",
            "Fantastic job, focus on form for the right side!",
            "Nice job on the left side! Focus on form, keep it up!",
            "Fantastic job on the left side! Keep pushing through!"
        ],
        "very encouraging": [
            "You're doing fantastic! One more set to go!",
            "Great job on the left side! Keep up the good work!",
            "You are a superstar! Just a few more, you got this!",
            "You're a champion! Push through, you've got this!",
            "Fantastic job! Focus on form, you're almost there!"
        ]
    },
    "bad both sides": {
        "very firm": [
            "Focus on your form, push through fatigue for better control.",
            "Focus on form, both sides need improvement.",
            "Focus on maintaining proper form. You can do it!",
            "Focus on maintaining proper form despite fatigue.",
            "Focus on your form and control to avoid injury."
        ],
        "firm": [
            "Focus on maintaining proper form even when fatigued.",
            "Focus on maintaining proper form, even when tired.",
            "Focus on form to prevent injury, tighten core muscles.",
            "Focus on maintaining proper form to prevent injury.",
            "Focus on maintaining proper form to prevent injuries."
        ],
        "neutral": [
            "Focus on maintaining proper form, especially towards the end.",
            "Focus on maintaining proper form to prevent injury.",
            "Focus on form to prevent injury, take a short break.",
            "Focus on maintaining proper form on both sides next time.",
            "Focus on maintaining good form throughout the exercise."
        ],
        "encouraging": [
            "You're doing great, just focus on form next time!",
            "Awesome effort! Focus on form to prevent fatigue.",
            "You're doing fantastic, just a bit more focus next time!",
            "Great work! Let's focus on form for the next set.",
            "Great job pushing through, focus on form next time!"
        ],
        "very encouraging": [
            "Fantastic job, you're getting stronger every rep!",
            "Way to push through! Remember to keep good form!",
            "You're doing great! Just a few more perfect reps!",
            "You're putting in fantastic effort, keep pushing through!",
            "You're pushing through, just a few more with perfect form!"
        ]
    },
    "corrected low_range left side": {
        "very firm": [
            "Focus on maintaining proper form through the full range.",
            "Focus on full range of motion. Fix left side.",
            "Focus on maintaining full range despite fatigue.",
            "Focus on maintaining full range of motion.",
            "Focus on full range of motion on the left side."
        ],
        "firm": [
            "Focus on full range of motion, even when tired.",
            "Ensure full range of motion on both sides.",
            "Maintain full range of motion on both sides.",
            "Ensure full range of motion on both sides.",
            "Remember to maintain full range of motion on both sides."
        ],
        "neutral": [
            "Focus on maintaining a consistent range of motion.",
            "Focus on maintaining consistent range of motion on both sides.",
            "Focus on maintaining consistent range of motion on both sides.",
            "Focus on maintaining proper range of motion for each rep.",
            "Focus on maintaining proper form, watch left side range."
        ],
        "encouraging": [
            "Fantastic work! Focus on maintaining proper form next time.",
            "Great job! Focus on maintaining the full range of motion.",
            "You're doing great, just focus on that full range!",
            "Great job! Focus on maintaining full range of motion.",
            "Nice work, focus on maintaining proper form."
        ],
        "very encouraging": [
            "You're almost there, keep pushing through with positivity!",
            "Fantastic job on noticing and correcting the mistake! Keep going!",
            "You're doing fantastic, keep pushing through!",
            "Fantastic job on improving the left arm's range of motion!",
            "Fantastic work! You're getting stronger with every curl."
        ]
    },
    "corrected low_range right side": {
        "very firm": [
            "Focus on full range to maximize results even when tired.",
            "Focus on full range of motion despite fatigue - improve form.",
            "Focus on full range of motion, push through fatigue.",
            "Push through the fatigue, maintain full range of motion.",
            "Focus on full range to utilize right bicep effectively."
        ],
        "firm": [
            "Focus on full range of motion for proper form.",
            "Focus on maintaining proper form, even when fatigued.",
            "Focus on maintaining full range of motion on both sides.",
            "Focus on full range of motion bilaterally.",
            "Focus on full range of motion, keep form tight."
        ],
        "neutral": [
            "Focus on maintaining consistent range of motion on both sides.",
            "Focus on maintaining proper range of motion on both sides.",
            "Focus on maintaining full range of motion on each side.",
            "Focus on keeping both arms at full range.",
            "Focus on maintaining consistent range of motion on both sides."
        ],
        "encouraging": [
            "You're almost there, push through the fatigue!",
            "Awesome job on improving your range of motion!",
            "Awesome effort, focus on maintaining full range of motion.",
            "Awesome job! Focus on full range next time.",
            "You're doing great, push through the fatigue!"
        ],
        "very encouraging": [
            "You're almost there, keep pushing through!",
            "Fantastic work on that correction, keep up the amazing effort!",
            "Amazing work so far! Let's fix that form next.",
            "Amazing job! Just a bit more on the right side.",
            "You're doing fantastic! Keep up the amazing work!"
        ]
    },
    "corrected low_range both sides": {
        "very firm": [
            "Focus on full range despite fatigue. Keep pushing.",
            "Focus on full range, maintain proper form despite fatigue.",
            "Focus on full range of motion to maximize the exercise.",
            "Focus on full range of motion, push through the fatigue.",
            "Focus on full range of motion to maximize results."
        ],
        "firm": [
            "Focus on maintaining full range of motion, push through fatigue.",
            "Focus on maintaining full range of motion next repetitions.",
            "Focus on full range of motion next time, push through fatigue.",
            "Focus on maintaining full range of motion, push through fatigue.",
            "Focus on full range of motion, even when fatigued."
        ],
        "neutral": [
            "Focus on maintaining full range of motion on both sides.",
            "Focus on maintaining full range of motion throughout the exercise.",
            "Focus on maintaining consistent range of motion on both sides.",
            "Focus on maintaining full range of motion.",
            "Focus on maintaining full range of motion evenly next time."
        ],
        "encouraging": [
            "Good job correcting the range of motion, keep it up!",
            "You're doing amazing - focus on maintaining full range!",
            "Great job improving your range of motion on both sides!",
            "Well done, focus on maintaining full range of motion!",
            "Fantastic job on correcting your form, you're almost there!"
        ],
        "very encouraging": [
            "Fantastic job pushing through, you're almost there!",
            "You're doing great! Push through the fatigue, almost there!",
            "You're amazing, keep pushing through with enthusiasm!",
            "Fantastic job pushing through, you're getting stronger every moment!",
            "Amazing work, push through fatigue - you got this!"
        ]
    },
    "corrected bad right side": {
        "very firm": [
            "Focus on maintaining proper form despite fatigue.",
            "Focus on maintaining proper form despite fatigue.",
            "Focus on maintaining proper form, especially on the left side.",
            "Focus on keeping proper form, push through the fatigue.",
            "Focus on maintaining proper form despite fatigue."
        ],
        "firm": [
            "Focus on keeping both elbows still throughout the movement.",
            "Focus on maintaining proper form to prevent injury.",
            "Focus on maintaining proper form even when fatigued.",
            "Focus on maintaining proper form on both sides.",
            "Focus on stabilizing both arms for proper form."
        ],
        "neutral": [
            "Focus on maintaining proper form to prevent injury.",
            "Focus on maintaining proper form to prevent injury.",
            "Focus on maintaining proper form to prevent injury.",
            "Let's focus on maintaining proper form as we continue.",
            "Focus on maintaining proper form despite fatigue."
        ],
        "encouraging": [
            "You're doing great, just keep pushing through the fatigue!",
            "Great job adjusting form! Keep up the good work!",
            "Nice job adjusting form on the left side! Keep it up!",
            "Awesome improvement on the left side, keep it up!",
            "Excellent job correcting the left side form, keep it up!"
        ],
        "very encouraging": [
            "You're doing fantastic, just a few more to go!",
            "Fantastic job pushing through, you're almost there!",
            "Fantastic job! Push through, you're almost there!",
            "You're doing amazing, keep pushing through the fatigue!",
            "You corrected the left side well, awesome job!"
        ]
    },
    "corrected bad left side": {
        "very firm": [
            "Focus on maintaining proper form even when tired.",
            "Focus on full range of motion for better results.",
            "Watch your form carefully, focus on technique.",
            "Focus on proper form, push through the fatigue.",
            "Focus on maintaining proper form, especially on the right side."
        ],
        "firm": [
            "Focus on keeping both elbows close to your sides.",
            "Focus on maintaining proper form, correct right side alignment.",
            "Focus on maintaining proper form, especially on the right side.",
            "Focus on proper form, control the movement.",
            "Focus on keeping the right elbow stable and aligned."
        ],
        "neutral": [
            "Focus on maintaining proper form, you're almost there.",
            "Focus on maintaining proper form to prevent injury.",
            "Focus on maintaining proper form to prevent injury.",
            "Focus on maintaining proper form for both sides.",
            "Focus on maintaining proper form for better muscle activation."
        ],
        "encouraging": [
            "Nice correction! Focus on form, you're almost there!",
            "You're doing great, focus on maintaining proper form.",
            "Nice job correcting your form, stay focused and keep going!",
            "Awesome job correcting the form, keep pushing through!",
            "Fantastic job on correcting your form, keep pushing through!"
        ],
        "very encouraging": [
            "Fantastic job pushing through, you're getting stronger every rep!",
            "Fantastic job on correcting your form, keep up the good work!",
            "Amazing job! You're getting stronger with each rep!",
            "You're doing amazing, push through the fatigue!",
            "You're making great progress, keep up the good work!"
        ]
    },
    "corrected bad both sides": {
        "very firm": [
            "Focus on maintaining proper form despite fatigue.",
            "Focus on your form, tighten your core for stability.",
            "Maintain correct form despite fatigue.",
            "Focus on maintaining proper form, even when fatigued.",
            "Focus on maintaining proper form to prevent injury."
        ],
        "firm": [
            "Focus on maintaining proper form, even when fatigued.",
            "Focus on maintaining proper form despite fatigue.",
            "Focus on maintaining proper form even when tired.",
            "Focus on maintaining proper form even when tired.",
            "Maintain proper form even when fatigued."
        ],
        "neutral": [
            "Focus on maintaining proper form despite fatigue.",
            "Remember to keep your form in check for the next set.",
            "Focus on maintaining proper form for better results.",
            "Focus on maintaining proper form and pacing, you're almost there.",
            "Focus on maintaining proper form as you continue."
        ],
        "encouraging": [
            "You're almost there, remember to keep your elbows stable.",
            "You're making progress, keep it up!",
            "Nice work, keep pushing through the fatigue!",
            "Nice work improving form, stay focused and keep it up!",
            "Fantastic job! Keep up the good work!"
        ],
        "very encouraging": [
            "Way to push through fatigue, you're getting stronger!",
            "Fantastic job! Just a few more to go!",
            "You're doing fantastic, push through the fatigue!",
            "Fantastic job pushing through, you're getting stronger every second!",
            "You're a star, keep pushing through, you've got this!"
        ]
    },
    "good form": {
        "very firm": [
            "Focus on maintaining proper form despite fatigue.",
            "Focus on maintaining proper form despite feeling fatigued.",
            "Focus on maintaining proper form despite fatigue.",
            "Focus on maintaining proper form despite feeling fatigued.",
            "Focus on keeping proper form to prevent injury."
        ],
        "firm": [
            "Focus on maintaining proper form despite feeling tired.",
            "Focus on maintaining proper form even through fatigue.",
            "Focus on maintaining proper form despite fatigue.",
            "Focus on maintaining proper form despite fatigue.",
            "Focus on maintaining proper form despite fatigue."
        ],
        "neutral": [
            "Maintain proper form to prevent injury and maximize gains.",
            "Focus on maintaining proper form as you proceed.",
            "Focus on maintaining proper form to prevent injury.",
            "Focus on maintaining proper form to prevent injury.",
            "Focus on maintaining proper form despite fatigue."
        ],
        "encouraging": [
            "Fantastic work on those bicep curls, you're crushing it!",
            "Awesome work, push through the fatigue!",
            "You're doing great, just a few more to go!",
            "You're doing fantastic, keep pushing through the fatigue!",
            "Great job! Push through, you've got this!"
        ],
        "very encouraging": [
            "Awesome job on that last repetition, keep pushing through! 🌟",
            "Amazing job on that last rep, you're a rockstar!",
            "Fantastic job! Push through, you're almost there!",
            "Fantastic job! Your form is on point, keep it up!",
            "Great job pushing through! You're getting stronger every day!"
        ]
    },
    "high_range left side": {
        "very firm": [
            "Focus on maintaining proper form even when fatigued.",
            "Maintain proper form, focus on controlled movements.",
            "Focus on controlling the range of motion on the left.",
            "Focus on maintaining proper form, even when fatigued.",
            "Focus on maintaining proper form to prevent injury."
        ],
        "firm": [
            "Focus on maintaining proper form for better results.",
            "Focus on maintaining proper form, even when fatigued.",
            "Maintain proper form, focus on controlled movements.",
            "Focus on maintaining proper form, even when fatigued.",
            "Focus on maintaining proper form, even when fatigued."
        ],
        "neutral": [
            "Remember to maintain proper range of motion on both sides.",
            "Focus on maintaining a consistent range of motion.",
            "Focus on maintaining equal range of motion on both sides.",
            "Focus on maintaining consistent range of motion on both sides.",
            "Focus on maintaining a consistent range of motion."
        ],
        "encouraging": [
            "Awesome job! Focus on maintaining form.",
            "Awesome work, focus on maintaining form next time.",
            "You're doing great, just focus on maintaining range of motion.",
            "Awesome job! Focus on keeping the range steady.",
            "Almost there! Focus on maintaining form for better results."
        ],
        "very encouraging": [
            "Awesome job! You're crushing those bicep curls!",
            "Amazing work! Push through, you're almost there!",
            "Excellent job pushing through, just a bit more control!",
            "Awesome job pushing through fatigue, keep up the good work!",
            "Fantastic effort! Let's focus on maintaining perfect form next time."
        ]
    },
    "high_range right side": {
        "very firm": [
            "Focus on maintaining proper form to prevent injury.",
            "Control the movement, focus on proper form and range.",
            "Focus on controlled movements to maintain proper form.",
            "Focus on maintaining proper form for better results.",
            "Focus on proper form for better results."
        ],
        "firm": [
            "Focus on maintaining proper form for better results.",
            "Focus on maintaining proper range of motion on both sides.",
            "Focus on maintaining proper range of motion next time.",
            "Focus on maintaining proper form, even when fatigued.",
            "Focus on maintaining proper form for optimal results."
        ],
        "neutral": [
            "Focus on maintaining a consistent range of motion.",
            "Focus on maintaining a consistent range of motion on both sides.",
            "Focus on maintaining proper form to prevent fatigue.",
            "Focus on maintaining proper range of motion on both sides.",
            "Focus on maintaining proper form during bicep curls."
        ],
        "encouraging": [
            "Almost there! Focus on keeping a controlled motion.",
            "Awesome job! Focus on maintaining proper form next time.",
            "Great work, focus on maintaining form for better range!",
            "Nice work, focus on form for better results.",
            "Amazing work, focus on maintaining form for best results!"
        ],
        "very encouraging": [
            "Great job pushing through! Keep up the good work!",
            "Amazing job, keep pushing through the fatigue!",
            "Fantastic work! Push through, you're almost there!",
            "Awesome work! Let's focus on maintaining form.",
            "Amazing work! Push through, you're almost there!"
        ]
    },
    "high_range both sides": {
        "very firm": [
            "Focus on proper form to prevent injury, maintain control.",
            "Focus on controlled movements, maintain proper form despite fatigue.",
            "Control the range to prevent injury.",
            "Focus on maintaining proper form despite fatigue.",
            "Focus on maintaining proper form, even when fatigued."
        ],
        "firm": [
            "Focus on maintaining proper form despite fatigue.",
            "Focus on maintaining proper form for better results.",
            "Focus on maintaining proper form despite fatigue.",
            "Focus on controlled movements for better form next time.",
            "Focus on maintaining proper form despite fatigue."
        ],
        "neutral": [
            "Focus on controlling the range of motion for better form.",
            "Focus on maintaining proper range of motion next time.",
            "Focus on maintaining proper range of motion next time.",
            "Focus on maintaining a consistent range of motion.",
            "Focus on maintaining proper range to prevent injury risks."
        ],
        "encouraging": [
            "Great job pushing through, focus on control next time!",
            "Awesome work, focus on maintaining proper form.",
            "Awesome job! Focus on maintaining range with control.",
            "Great job pushing through, focus on form next time!",
            "Awesome work, focus on maintaining form through fatigue."
        ],
        "very encouraging": [
            "Awesome job! Keep up the hard work!",
            "Fantastic effort! Let's maintain that range with control.",
            "Fantastic job on those bicep curls, you're unstoppable!",
            "You're almost there! Let's focus on perfect form next time.",
            "Great job pushing through, you're so close to finishing strong!"
        ]
    },
    "corrected high_range left side": {
        "very firm": [
            "Focus on maintaining proper form despite fatigue.",
            "Focus on maintaining proper form despite fatigue.",
            "Maintain proper form on both sides, focus on alignment.",
            "Focus on maintaining proper form despite fatigue.",
            "Focus on maintaining proper form despite fatigue."
        ],
        "firm": [
            "Focus on maintaining consistent range of motion on both sides.",
            "Focus on maintaining consistent range of motion, despite fatigue.",
            "Ensure consistent range of motion on both sides.",
            "Focus on achieving equal range on both sides.",
            "Focus on maintaining proper form, even when fatigued."
        ],
        "neutral": [
            "Focus on maintaining consistent range of motion on both sides.",
            "Focus on maintaining consistent range of motion on both sides.",
            "Remember to maintain balance between both sides next time.",
            "Focus on maintaining consistent range of motion on both sides.",
            "Focus on maintaining consistent range of motion."
        ],
        "encouraging": [
            "You're pushing through fatigue with determination. Well done!",
            "Excellent job maintaining the correct range of motion! Keep it up!",
            "You're doing fantastic, keep up the great work!",
            "You're doing great, just a few more reps to go!",
            "Excellent job! Focus on maintaining form with each rep."
        ],
        "very encouraging": [
            "You're doing great! Push through, you've got this!",
            "You're doing fantastic, keep up the amazing work!",
            "Awesome job! Your left arm is getting stronger!",
            "Awesome job! Push through, you're almost there!",
            "Awesome job, keep pushing through the fatigue!"
        ]
    },
    "corrected high_range right side": {
        "very firm": [
            "Focus on maintaining proper form, even when fatigued.",
            "Focus on maintaining proper form to prevent injury.",
            "Focus on maintaining proper form despite fatigue.",
            "Focus on controlling the right arm's range of motion.",
            "Focus on maintaining proper form despite fatigue."
        ],
        "firm": [
            "Focus on maintaining proper form, even when fatigued.",
            "Focus on maintaining proper form through fatigue for better results.",
            "Focus on maintaining proper form despite fatigue.",
            "Focus on keeping your right arm movement controlled and smooth.",
            "Focus on maintaining proper form and range of motion."
        ],
        "neutral": [
            "Focus on maintaining consistent range of motion bilaterally.",
            "Maintain consistent form to avoid injury.",
            "Focus on maintaining a consistent range of motion.",
            "Focus on maintaining consistent range of motion on both sides.",
            "Focus on maintaining a consistent range of motion."
        ],
        "encouraging": [
            "Awesome job adjusting the range! Keep it up!",
            "Fantastic effort, remember to maintain proper form!",
            "Awesome job! Focus on the correct range next time.",
            "Great job staying focused and improving your form with fatigue!",
            "Great job improving your range of motion on that curl!"
        ],
        "very encouraging": [
            "Fantastic job adjusting your form, you're doing great!",
            "Amazing job pushing through, you're almost there!",
            "Awesome job! Keep pushing through, you're almost there!",
            "Amazing job! Push through, you're almost there!",
            "You're rocking those bicep curls, keep up the fantastic work!"
        ]
    },
    "corrected high_range both sides": {
        "very firm": [
            "Focus on maintaining correct form despite fatigue.",
            "Focus on maintaining proper form despite fatigue.",
            "Focus on proper form even when fatigued.",
            "Focus on maintaining proper form despite fatigue, push through.",
            "Focus on maintaining proper form and range despite fatigue."
        ],
        "firm": [
            "Focus on maintaining proper form despite fatigue.",
            "Focus on maintaining proper range with less fatigue.",
            "Maintain proper form despite fatigue.",
            "Focus on maintaining proper form despite fatigue.",
            "Focus on maintaining proper form to prevent injury."
        ],
        "neutral": [
            "Focus on maintaining the correct range of motion.",
            "Focus on maintaining proper form despite fatigue.",
            "Focus on maintaining consistent range of motion.",
            "Focus on maintaining proper form to prevent injury.",
            "Maintain proper form to prevent injury."
        ],
        "encouraging": [
            "Excellent job correcting the range on both sides! Keep it up!",
            "Great job correcting the range of motion, keep it up!",
            "Fantastic job adjusting the range with control. Keep it up!",
            "You're making progress, keep pushing through!",
            "You're making progress, focus on maintaining good form."
        ],
        "very encouraging": [
            "Amazing progress even when tired! You're a rockstar!",
            "You're doing fantastic, keep pushing through!",
            "Amazing job on correcting your range of motion! Keep it up!",
            "You're doing amazing, just a few more reps to go!",
            "Fantastic job pushing through fatigue, you're almost there!"
        ]
    },
    "fast": {
        "very firm": [
            "Focus on maintaining proper form for full range of motion.",
            "Focus on maintaining proper form and speed for each repetition.",
            "Focus on maintaining proper form, even when fatigued.",
            "Focus on maintaining a consistent pace despite fatigue.",
            "Focus on maintaining proper form to prevent injury."
        ],
        "firm": [
            "Focus on maintaining proper form despite fatigue.",
            "Focus on maintaining proper form despite fatigue.",
            "Focus on speed and form, maintain control through fatigue.",
            "Focus on maintaining proper form to avoid injury.",
            "Focus on maintaining proper form throughout each repetition."
        ],
        "neutral": [
            "Focus on maintaining a consistent speed throughout the exercise.",
            "Focus on maintaining a controlled pace to avoid fatigue.",
            "Focus on maintaining proper form to prevent injury.",
            "Focus on maintaining proper form, take a short break.",
            "Focus on maintaining consistent speed throughout the next repetitions."
        ],
        "encouraging": [
            "You're pushing through, just a little more to go!",
            "You're almost there, just a little bit more!",
            "Nice work, you're almost there!",
            "Good job pushing through, focus on maintaining form.",
            "You're doing great, just focus on maintaining the speed!"
        ],
        "very encouraging": [
            "Fantastic job pushing through! Keep up the amazing work!",
            "You're pushing through fatigue - amazing dedication!",
            "You're doing amazing! Just a few more, you got this!",
            "You're doing great! Let's finish strong with good form!",
            "You're pushing through, amazing job!"
        ]
    },
    "slow": {
        "very firm": [
            "Control your pace, focus on form to prevent injury.",
            "Focus on maintaining proper form, even when fatigued.",
            "Control your speed for better form even when fatigued.",
            "Control the speed to avoid injury.",
            "Control the speed to prevent injury."
        ],
        "firm": [
            "Control the speed for better form and effectiveness.",
            "Control your speed for better form, focus on technique.",
            "Control the speed, focus on form despite fatigue.",
            "Control your speed for better form, focus on tempo.",
            "Control the speed for proper muscle engagement."
        ],
        "neutral": [
            "Focus on maintaining a controlled pace to prevent injury.",
            "Focus on maintaining proper form to prevent injuries.",
            "Focus on maintaining a controlled pace to prevent injury.",
            "Control the speed of each repetition to avoid injury.",
            "Focus on controlling the speed for better form."
        ],
        "encouraging": [
            "You're pushing through fatigue, great job! Keep it up!",
            "Good job pushing through, focus on form.",
            "Nice work! Focus on control for the next rep.",
            "Awesome job! Make sure to keep the movement controlled.",
            "Amazing work, remember to focus on control and form."
        ],
        "very encouraging": [
            "Awesome job! Make sure to maintain a steady pace.",
            "You're pushing through, keep up the good work!",
            "Fantastic effort! Just one more set to go!",
            "You're almost there, push through that fatigue with confidence!",
            "You're crushing it! Just a bit slower next time."
        ]
    },
    "corrected fast": {
        "very firm": [
            "Slow down your pace, maintain proper form throughout.",
            "Control the speed to maintain proper form, focus on control.",
            "Slow down the movement for better control and form.",
            "Control the movement to prevent swinging.",
            "Control the movement pace, focus on form despite fatigue."
        ],
        "firm": [
            "Control the speed to maintain proper form, focus on control.",
            "Control the movement, focus on form even when tired.",
            "Control the movement and maintain a steady pace.",
            "Control the speed to maintain proper form and prevent injury.",
            "Control the speed, maintain proper form till the end."
        ],
        "neutral": [
            "Focus on maintaining a steady pace to prevent fatigue.",
            "Focus on maintaining a steady pace to prevent fatigue.",
            "Focus on maintaining a controlled pace to prevent fatigue.",
            "Focus on maintaining a consistent pace to prevent rushing.",
            "Focus on maintaining a steady pace to prevent fatigue."
        ],
        "encouraging": [
            "Fantastic job! Remember to control the speed.",
            "Great job fixing the speed, keep it up!",
            "You're doing great! Just a few more reps to go.",
            "Nice job staying focused and controlling the movement!",
            "You're doing great, focus on controlling the speed."
        ],
        "very encouraging": [
            "You're doing fantastic, keep up the amazing work!",
            "You're doing fantastic, keep up the good work!",
            "You're doing fantastic, keep up the hard work!",
            "You're doing fantastic! Just one more rep to go!",
            "You're doing fantastic, keep up the amazing work!"
        ]
    },
    "corrected slow": {
        "very firm": [
            "Pick up the pace, maintain proper form despite fatigue.",
            "Pick up the pace, maintain proper form.",
            "Increase the speed of your bicep curls for better form.",
            "Speed up the movement to maintain proper form.",
            "Pick up the pace, maintain proper form for effectiveness."
        ],
        "firm": [
            "Pick up the pace on your bicep curls for more efficiency.",
            "Maintain a controlled speed for optimal form and results.",
            "Control the speed to maintain form and prevent injury.",
            "Control the speed, maintain proper form.",
            "Focus on maintaining a controlled pace to prevent mistakes."
        ],
        "neutral": [
            "Focus on maintaining a consistent pace to prevent exhaustion.",
            "Focus on maintaining a consistent pace to prevent fatigue.",
            "Focus on maintaining a steady pace during the curls.",
            "Focus on maintaining proper form to prevent injury.",
            "Maintain a controlled pace to prevent injury."
        ],
        "encouraging": [
            "Good job pushing through, your form is looking better!",
            "Great job pushing through, you're almost there!",
            "Nice job, remember to keep a steady pace.",
            "You're doing great, just a few more reps to go!",
            "Great job pushing through, focus on your form."
        ],
        "very encouraging": [
            "You're doing fantastic, push through the fatigue!",
            "You're doing amazing, keep pushing through the fatigue!",
            "You're pushing through fatigue like a champ! Keep it up!",
            "Amazing work, push through the fatigue, you've got this!",
            "Fantastic job pushing through, you're almost there!"
        ]
    },
    "good speed": {
        "very firm": [
            "Focus on maintaining proper form despite fatigue.",
            "Focus on maintaining proper form, push through the fatigue.",
            "Focus on proper form despite fatigue.",
            "Focus on maintaining proper form despite fatigue.",
            "Focus on maintaining proper form despite fatigue."
        ],
        "firm": [
            "Focus on maintaining proper form as you continue.",
            "Focus on maintaining proper form despite fatigue.",
            "Focus on maintaining proper form despite fatigue.",
            "Focus on maintaining proper form despite fatigue.",
            "Push through the fatigue, keep proper form for safety."
        ],
        "neutral": [
            "Maintain proper form, focus on quality over quantity.",
            "Focus on maintaining proper form to prevent injury.",
            "Focus on your form to prevent injury with fatigue.",
            "Remember to focus on maintaining proper form.",
            "Focus on maintaining proper form despite fatigue."
        ],
        "encouraging": [
            "Fantastic job! Just a few more to go!",
            "You're doing great, just a few more to go!",
            "Fantastic effort! Rest up, you pushed through fabulously!",
            "You're doing great, just a few more to go!",
            "Nice work on maintaining good speed throughout the bicep curls!"
        ],
        "very encouraging": [
            "Way to push through the fatigue! Incredible effort!",
            "Fantastic job! Hang in there, you're almost done!",
            "You're crushing these curls! Keep pushing through!",
            "Fantastic work, keep pushing through the fatigue!",
            "Amazing job pushing through, you're a rockstar!"
        ]
    }
}