{
    "low_range left side": {
        "very firm": [
            "Focus on full range even when tired; improve left side.",
            "Maintain proper form to prevent injury, focus on range.",
            "Focus on maintaining full range of motion on both sides.",
            "Focus on maintaining full range on both sides next time.",
            "Focus on maintaining full range of motion on the left side."
        ],
        "firm": [
            "Focus on maintaining proper form on both sides.",
            "Focus on maintaining full range of motion on both sides.",
            "Focus on improving left side range. Keep pushing.",
            "Focus on full range with left arm, you can do it.",
            "Maintain full range of motion, focus on left side."
        ],
        "neutral": [
            "Focus on maintaining equal range of motion on both sides.",
            "Focus on maintaining consistent range of motion on both sides.",
            "Focus on improving left side range of motion next time.",
            "Focus on maintaining equal range of motion on both sides.",
            "Focus on maintaining a consistent range of motion on both sides."
        ],
        "encouraging": [
            "Fantastic work! Let's focus on balance next time.",
            "Maintain focus on form, you're doing well overall.",
            "You're doing great, focus on improving left side's range.",
            "Great work! Focus on full range of motion next time.",
            "You've got this! Focus on better range of motion."
        ],
        "very encouraging": [
            "You're doing fantastic! Let's crush the next set!",
            "Fantastic job! Let's focus on a full range next time!",
            "You're doing amazing! Let's focus on a full range.",
            "Fantastic job! Let's focus on reaching full range next time!",
            "Great work! You're getting stronger with each curl!"
        ]
    },
    "low_range right side": {
        "very firm": [
            "Focus on full range of motion for better results.",
            "Focus on full range, maintain form despite fatigue.",
            "Focus on full range of motion. Keep pushing.",
            "Focus on full range of motion on the right side.",
            "Focus on full range of motion on the right side."
        ],
        "firm": [
            "Focus on maintaining full range on the right side.",
            "Focus on full range next time, even when tired.",
            "Focus on using full range of motion on the right arm.",
            "Focus on maintaining a consistent range on both sides.",
            "Focus on maintaining full range of motion on the right."
        ],
        "neutral": [
            "Focus on improving the right side range of motion.",
            "Focus on maintaining consistent form on both sides.",
            "Focus on maintaining equal range on both sides.",
            "Focus on improving range on the right side next time.",
            "Focus on maintaining even range of motion on both sides."
        ],
        "encouraging": [
            "Focus on better range on the right side, keep it up!",
            "Great job, focus on full range next time.",
            "Great job! Focus on improving the right side's form.",
            "Maintain good form on both sides, you're doing great!",
            "Fantastic job! Focus on full range of motion next time."
        ],
        "very encouraging": [
            "Amazing job! Let's focus on improving the right side.",
            "You're doing a fantastic job, keep up the good work!",
            "You're doing great! Let's push through together!",
            "Awesome work! Let's focus on full range next time.",
            "Amazing work! Focus on the right side's range next."
        ]
    },
    "low_range both sides": {
        "very firm": [
            "Focus on full range of motion for stronger results.",
            "Focus on full range, maintain form despite fatigue.",
            "Focus on full range of motion, push through fatigue.",
            "Focus on full range for better results.",
            "Focus on improving range of motion for better results."
        ],
        "firm": [
            "Focus on improving range of motion with each curl.",
            "Focus on full range of motion for better results.",
            "Focus on maintaining a full range of motion.",
            "Focus on maintaining full range on both sides next time.",
            "Focus on increasing the range of motion for the curls."
        ],
        "neutral": [
            "Focus on maintaining full range of motion next time.",
            "Focus on maintaining full range of motion next time.",
            "Focus on maintaining full range of motion next time.",
            "Focus on maintaining a full range of motion in curls.",
            "Focus on maintaining full range of motion for better results."
        ],
        "encouraging": [
            "You're doing great, focus on maintaining full range of motion!",
            "Push through the fatigue, aim for better range next time!",
            "Awesome job! Let's focus on full range next time.",
            "You're doing great! Focus on that full range of motion.",
            "Focus on maintaining a full range of motion next time."
        ],
        "very encouraging": [
            "You're doing amazing, push through with strong form!",
            "You're doing great, let's focus on that full range!",
            "Keep up the good work, you're doing amazing!",
            "You're doing great! Let's focus on full range.",
            "Great job pushing through, you're amazing!"
        ]
    },
    "bad left side": {
        "very firm": [
            "Focus on maintaining proper form on the left side now.",
            "Focus on keeping both arms aligned and controlled.",
            "Focus on maintaining proper form on both sides.",
            "Focus on keeping symmetry in your form, especially on left.",
            "Focus on maintaining proper form on both sides."
        ],
        "firm": [
            "Focus on maintaining proper form on both sides next time.",
            "Focus on maintaining proper form on the left side.",
            "Focus on maintaining proper form on both sides.",
            "Focus on maintaining proper form on both sides next time.",
            "Focus on maintaining proper form for both arms."
        ],
        "neutral": [
            "Focus on both sides, maintain form with less fatigue.",
            "Focus on maintaining consistent form on both sides evenly.",
            "Focus on both sides for balanced bicep curls.",
            "Focus on maintaining even form on both sides.",
            "Focus on maintaining consistent form on both sides."
        ],
        "encouraging": [
            "Good job, focus on maintaining form despite fatigue.",
            "Great job on the right side, focus on form.",
            "You're doing great, focus on maintaining form while tired!",
            "Nice job, keep pushing through with good form!",
            "Awesome job! Focus on maintaining form evenly on both sides."
        ],
        "very encouraging": [
            "Keep pushing, you're stronger than you think!",
            "Awesome job! Let's maintain that form on both sides!",
            "Amazing work! Let's focus on form for next set.",
            "Amazing work, keep pushing through with positivity!",
            "Fantastic job pushing through! Keep up the great work!"
        ]
    },
    "bad right side": {
        "very firm": [
            "Focus on maintaining proper form for both sides.",
            "Focus on maintaining form on the right side, no compromises.",
            "Focus on maintaining proper form on the right side now.",
            "Focus on maintaining proper form on the right side.",
            "Focus on maintaining proper form on both sides."
        ],
        "firm": [
            "Focus on maintaining proper form on the right bicep curl.",
            "Focus on maintaining proper form on the right side.",
            "Focus on maintaining proper form on the right side.",
            "Focus on maintaining proper form on the right side.",
            "Focus on stabilizing the right arm for better form."
        ],
        "neutral": [
            "Focus on maintaining symmetry and form during every repetition.",
            "Focus on maintaining form on both sides.",
            "Focus on maintaining good form on both sides.",
            "Focus on maintaining symmetry between both arms during curls.",
            "Focus on maintaining form on both sides evenly."
        ],
        "encouraging": [
            "Great job, focus on form for better results!",
            "Nice job, focus on maintaining form on both sides.",
            "Fantastic job with the left side, let's focus on balance!",
            "Fantastic job with good form! Keep it up!",
            "Awesome job! Focus on form for balance next time."
        ],
        "very encouraging": [
            "You're a rockstar! Let's focus on balance next time.",
            "You're a rockstar! Focus on form, keep it up!",
            "You're crushing it! Just a bit more on the right!",
            "You're doing amazing, push through the tiredness, you got this!",
            "Great job! Focus on your form, you're almost there!"
        ]
    },
    "bad both sides": {
        "very firm": [
            "Focus on your form, tighten your core, and push through.",
            "Focus on maintaining proper form despite fatigue.",
            "Focus on proper form, control the movement. Keep pushing.",
            "Focus on maintaining proper form for the next repetition.",
            "Focus on your form to prevent injury."
        ],
        "firm": [
            "Focus on maintaining proper form, especially when fatigued.",
            "Focus on maintaining proper form for better results.",
            "Focus on maintaining proper form despite fatigue.",
            "Focus on form to prevent injury, tighten form next time.",
            "Focus on maintaining proper form to prevent injury."
        ],
        "neutral": [
            "Focus on maintaining proper form for better results.",
            "Focus on maintaining proper form to prevent injuries.",
            "Focus on maintaining proper form for better results.",
            "Focus on maintaining proper form for each repetition.",
            "Focus on maintaining proper form, especially towards the end."
        ],
        "encouraging": [
            "Great job pushing through! Focus on form for next set.",
            "Well done! Focus on your form and breathe deeply.",
            "You're doing great, keep up the good work!",
            "Great work, focus on your form for stronger curls!",
            "Great job pushing through, let's focus on form next!"
        ],
        "very encouraging": [
            "You're doing great! Keep up the amazing work!",
            "You're doing great, keep pushing through with enthusiasm!",
            "You're doing fantastic! Let's focus on form together.",
            "Amazing work today! Just a little more focus next time.",
            "Fantastic effort! Let's focus on form for next set."
        ]
    },
    "corrected low_range left side": {
        "very firm": [
            "Focus on maintaining full range of motion on both sides.",
            "Focus on maintaining correct range of motion, push through fatigue.",
            "Focus on maintaining full range on both sides.",
            "Focus on maintaining full range of motion on both sides.",
            "Focus on full range of motion on the left side."
        ],
        "firm": [
            "Focus on full range on the left side.",
            "Focus on maintaining proper range of motion on left side.",
            "Focus on full range of motion for better results.",
            "Maintain full range of motion on the left side.",
            "Maintain full range of motion on the left side."
        ],
        "neutral": [
            "Focus on maintaining full range of motion on both sides.",
            "Focus on maintaining consistent range of motion on both sides.",
            "Focus on maintaining consistent range of motion on both sides.",
            "Focus on maintaining the full range of motion.",
            "Focus on maintaining full range on both sides."
        ],
        "encouraging": [
            "You're doing great, focus on maintaining full range.",
            "Well done! Focus on your form for better results.",
            "Almost there! Focus on full range for a balanced workout.",
            "You're doing great, focus on maintaining good form.",
            "You're doing great! Focus on maintaining full range of motion."
        ],
        "very encouraging": [
            "You're working hard! Let's keep that left elbow up.",
            "You're doing great, push through the fatigue!",
            "You're doing fantastic, just a few more to go!",
            "You're doing fantastic, keep up the amazing work!",
            "You're doing amazing, push through with determination!"
        ]
    },
    "corrected low_range right side": {
        "very firm": [
            "Focus on full range for proper muscle activation.",
            "Focus on full range even when tired, push harder.",
            "Focus on maintaining full range of motion on both sides.",
            "Focus on maintaining the full range of motion next time.",
            "Focus on full range, maintain correct form."
        ],
        "firm": [
            "Focus on maintaining full range of motion on both sides.",
            "Focus on full range of motion for better results.",
            "Focus on full range of motion, push through the fatigue.",
            "Focus on full range of motion despite fatigue.",
            "Focus on full range of motion, push through the fatigue."
        ],
        "neutral": [
            "Focus on maintaining full range of motion on both sides.",
            "Focus on maintaining full range of motion on both sides.",
            "Maintain consistent range of motion on both sides.",
            "Focus on maintaining full range of motion evenly next time.",
            "Focus on maintaining consistent range of motion on both sides."
        ],
        "encouraging": [
            "Awesome job improving your range on the right side!",
            "Good job! Focus on maintaining correct form.",
            "You're doing fantastic, focus on maintaining form with control.",
            "Great job maintaining proper range throughout, keep it up!",
            "Nice job correcting the range of motion, keep it up!"
        ],
        "very encouraging": [
            "You're doing fantastic, keep up the amazing work!",
            "You're doing fantastic! Push through, you've got this!",
            "Fantastic job! Just a few more, you've got this!",
            "You're getting stronger with each rep, keep it up!",
            "You're pushing through, keep it up!"
        ]
    },
    "corrected low_range both sides": {
        "very firm": [
            "Maintain full range of motion on all reps, focus!",
            "Focus on maintaining full range of motion with each curl.",
            "Full range of motion is crucial, push through the fatigue.",
            "Focus on maintaining full range of motion without shortcuts.",
            "Focus on full range of motion, push through fatigue."
        ],
        "firm": [
            "Focus on full range of motion, maintain form even tired.",
            "Focus on full range of motion despite fatigue.",
            "Focus on completing the full range of motion next time.",
            "Focus on full range to maximize effectiveness.",
            "Focus on maintaining full range of motion this time."
        ],
        "neutral": [
            "Focus on maintaining full range of motion next time.",
            "Focus on maintaining full range of motion. Well done.",
            "Focus on maintaining full range of motion.",
            "Focus on maintaining full range of motion to prevent injury.",
            "Focus on maintaining full range of motion next time."
        ],
        "encouraging": [
            "Great job on improving your range of motion! Keep it up!",
            "Nice job fixing the range of motion. Keep it up!",
            "You're doing great, just a little more to go!",
            "Well done! Focus on full range of motion next time.",
            "You're doing great, push through the fatigue!"
        ],
        "very encouraging": [
            "Amazing job pushing through, you're almost there!",
            "Fantastic job pushing through, keep up the amazing work!",
            "You're doing great, push through the fatigue!",
            "You're doing fantastic! Push through, just a few more!",
            "You're doing fantastic! Just a few more reps to go!"
        ]
    },
    "corrected bad right side": {
        "very firm": [
            "Watch your form closely, focus on control and alignment.",
            "Focus on keeping the left elbow stable and in line.",
            "Focus on maintaining proper form to prevent injury.",
            "Focus on full range of motion, tighten core for stability.",
            "Focus on maintaining proper form, push through the fatigue."
        ],
        "firm": [
            "Focus on maintaining proper form, even when tired.",
            "Focus on keeping both elbows close to your body.",
            "Focus on maintaining proper form even when tired.",
            "Focus on maintaining proper form despite feeling tired.",
            "Focus on maintaining proper form despite fatigue."
        ],
        "neutral": [
            "Focus on keeping both arms in proper form.",
            "Focus on maintaining proper form on both sides.",
            "Focus on keeping both arms aligned during bicep curls.",
            "Focus on keeping both arms at the same level.",
            "Focus on maintaining proper form for stronger results."
        ],
        "encouraging": [
            "You're getting stronger with every rep, keep it up!",
            "Nice job correcting the form, keep up the good work!",
            "Great job fixing that form! Keep up the good work!",
            "Nice job correcting your form on the left side!",
            "Nice job correcting your form on the left side!"
        ],
        "very encouraging": [
            "You're making excellent progress, stay strong!",
            "You're powering through! Just a few more to go!",
            "You're doing great, keep pushing through with positive energy!",
            "Awesome work! Keep pushing through, you've got this!",
            "Awesome correction! Keep up the fantastic work!"
        ]
    },
    "corrected bad left side": {
        "very firm": [
            "Focus on maintaining proper form despite fatigue.",
            "Focus on maintaining proper form even when tired.",
            "Focus on proper form, push through the fatigue.",
            "Focus on form, tighten core for better stability.",
            "Focus on quality over quantity; watch your form closely."
        ],
        "firm": [
            "Focus on maintaining proper form despite fatigue.",
            "Focus on proper form, control the movement with strength.",
            "Focus on maintaining proper form to prevent injury.",
            "Focus on maintaining proper form even when fatigued.",
            "Focus on maintaining proper form despite feeling tired."
        ],
        "neutral": [
            "Focus on maintaining proper form, especially on the right side.",
            "Focus on maintaining proper form to prevent injury.",
            "Focus on form for better results on both arms.",
            "Focus on maintaining proper form for better results.",
            "Focus on maintaining proper form for better results."
        ],
        "encouraging": [
            "Awesome job catching that mistake, keep up the good work!",
            "Good job correcting your form, keep up the effort!",
            "Fantastic job adjusting your form on the right side!",
            "Fantastic work, focus on maintaining proper form.",
            "Nice work fixing your form on the right side!"
        ],
        "very encouraging": [
            "Amazing job! You're getting stronger with each rep!",
            "Awesome work! Just a few more with your best form! ",
            "Great job correcting the form! Keep up the hard work!",
            "Fantastic job adjusting your form, you're making great progress!",
            "Way to correct the form and push through the tiredness!"
        ]
    },
    "corrected bad both sides": {
        "very firm": [
            "Focus on maintaining proper form, even when fatigued.",
            "Maintain proper form despite tiredness, focus on technique.",
            "Focus on maintaining proper form even when fatigued.",
            "Focus on maintaining proper form despite feeling tired.",
            "Focus on maintaining proper form despite feeling tired."
        ],
        "firm": [
            "Focus on maintaining proper form to prevent injury.",
            "Focus on maintaining proper form to prevent injury.",
            "Focus on maintaining proper form despite feeling tired.",
            "Focus on maintaining proper form, especially when fatigued.",
            "Focus on maintaining proper form and controlled movements."
        ],
        "neutral": [
            "Watch your form to prevent injury.",
            "Focus on maintaining proper form to prevent injury.",
            "Focus on maintaining proper form to prevent injury.",
            "Focus on maintaining proper form to prevent injury.",
            "Focus on maintaining proper form throughout the exercise."
        ],
        "encouraging": [
            "You're doing great, focus on maintaining proper form.",
            "Nice job focusing on your form, keep up the good work!",
            "Nice correction on form! Keep up the good work!",
            "Good job adjusting form, focus on breathing throughout.",
            "You're doing great, stay focused on your form."
        ],
        "very encouraging": [
            "Fantastic effort, keep pushing through the fatigue!",
            "You're doing fantastic! Push through, you've got this!",
            "Way to go! Push through fatigue, focus on form!",
            "You're doing fantastic! Push through the fatigue, you've got this!",
            "Awesome job pushing through, you're killing it!"
        ]
    },
    "good form": {
        "very firm": [
            "Focus on maintaining proper form despite fatigue.",
            "Focus on maintaining proper form even when fatigued.",
            "Focus on maintaining proper form despite fatigue.",
            "Focus on maintaining proper form even as you're tired.",
            "Focus on maintaining proper form, even when fatigued."
        ],
        "firm": [
            "Focus on maintaining proper form despite feeling fatigued.",
            "Focus on maintaining proper form despite fatigue.",
            "Focus on maintaining proper form despite tiredness.",
            "Focus on maintaining proper form despite fatigue.",
            "Focus on controlled movements despite fatigue."
        ],
        "neutral": [
            "Maintain your form and pace to prevent injury in fatigue.",
            "Maintain proper form to prevent injury due to fatigue.",
            "Maintain consistent form as you proceed with the exercise.",
            "Maintain proper form, focus on breathing during bicep curls.",
            "Maintain proper form to prevent injury."
        ],
        "encouraging": [
            "Fantastic job on that last rep, keep up the good work!",
            "You're doing great, keep pushing through!",
            "Awesome job on that last repetition! You're doing great!",
            "Fantastic job! Just a few more, you've got this!",
            "You're doing great, just a few more to go!"
        ],
        "very encouraging": [
            "Fantastic job on that last bicep curl, keep it up!",
            "You're doing fantastic, keep up the awesome work!",
            "You're doing fantastic! Keep up the amazing work!",
            "Fantastic work! Remember to breathe and stay focused.",
            "Awesome job, just a few more reps to go!"
        ]
    },
    "high_range left side": {
        "very firm": [
            "Focus on maintaining proper range, even when tired.",
            "Focus on maintaining proper form and range throughout.",
            "Focus on maintaining proper form, even when fatigued.",
            "Control your left arm, maintain proper form.",
            "Focus on maintaining proper form, even when fatigued."
        ],
        "firm": [
            "Focus on maintaining proper form for better results.",
            "Focus on maintaining proper form, especially on the left side.",
            "Control the left arm to maintain proper form.",
            "Control your left side more for better form.",
            "Focus on maintaining proper form despite fatigue."
        ],
        "neutral": [
            "Focus on maintaining consistent range of motion on both sides.",
            "Focus on maintaining proper form to prevent injury.",
            "Focus on keeping the range of motion consistent.",
            "Focus on maintaining consistent range of motion on both sides.",
            "Maintain consistent range of motion for balanced bicep curls."
        ],
        "encouraging": [
            "Fantastic job, focus on maintaining smooth movements!",
            "Awesome effort! Let's focus on maintaining form next time.",
            "Good job pushing through, focus on form and rest!",
            "You're doing fantastic, just focus on the range.",
            "You're making amazing progress! Keep up the good work!"
        ],
        "very encouraging": [
            "Great job pushing through, you're almost there!",
            "Awesome job! Just a bit more control on the left.",
            "You're doing great! Let's focus on that left side.",
            "You're doing great! Push through the fatigue with positivity!",
            "Nice work! Let's focus on that left side next time."
        ]
    },
    "high_range right side": {
        "very firm": [
            "Maintain proper form to prevent injury.",
            "Control the range of motion, focus on form.",
            "Focus on maintaining proper form to prevent injury.",
            "Focus on maintaining proper form on the right side.",
            "Control the range of motion, focus on quality."
        ],
        "firm": [
            "Watch the range of motion carefully next time.",
            "Focus on maintaining proper form with controlled movements.",
            "Focus on maintaining proper form for optimal results.",
            "Focus on maintaining proper form for better results.",
            "Maintain proper form, focus on controlled movement and rest."
        ],
        "neutral": [
            "Focus on maintaining a consistent range of motion on both sides.",
            "Focus on maintaining proper range of motion next time.",
            "Focus on maintaining consistent range of motion on both sides.",
            "Focus on maintaining proper range of motion next time.",
            "Focus on maintaining a consistent range of motion."
        ],
        "encouraging": [
            "Nice work! Let's focus on form for next set.",
            "Great job! Focus on controlled movements.",
            "Great job on the bicep curls, focus on form!",
            "Great job, focus on maintaining proper form next time.",
            "Focus on quality over quantity. Keep up the good work!"
        ],
        "very encouraging": [
            "Amazing effort! Let's focus on maintaining form next time.",
            "You're doing amazing, keep pushing through!",
            "Fantastic effort! Let's aim for more controlled movements next time.",
            "You're doing amazing! Let's keep that energy up!",
            "Amazing job! Let's focus on form, keep it up!"
        ]
    },
    "high_range both sides": {
        "very firm": [
            "Focus on maintaining proper form despite fatigue.",
            "Control the range of motion, focus on form.",
            "Focus on maintaining proper form and control, even when tired.",
            "Focus on proper form, control the range of motion.",
            "Focus on maintaining proper form for better results next time."
        ],
        "firm": [
            "Focus on maintaining proper range of motion next time.",
            "Focus on maintaining a controlled range of motion.",
            "Focus on maintaining proper form, control the range of motion.",
            "Focus on controlled motion for the next repetition.",
            "Focus on maintaining proper form, even when fatigued."
        ],
        "neutral": [
            "Focus on maintaining proper form for safer movements.",
            "Focus on maintaining a consistent range of motion next time.",
            "Focus on maintaining consistent range with controlled movements.",
            "Maintain proper form to prevent injury.",
            "Focus on maintaining the ideal range of motion."
        ],
        "encouraging": [
            "Great job on your bicep curls, push through the fatigue!",
            "Great job! Focus on maintaining proper form for best results.",
            "Well done! Focus on maintaining proper form.",
            "Awesome effort! Let's focus on control with less fatigue.",
            "Excellent work, focus on maintaining proper form."
        ],
        "very encouraging": [
            "Amazing job! Focus on maintaining proper form.",
            "You're doing amazing, just a bit more on control!",
            "Amazing effort! Push through fatigue, maintain form.",
            "You're working hard, keep up the amazing effort!",
            "Excellent effort! Let's focus on maintaining good form."
        ]
    },
    "corrected high_range left side": {
        "very firm": [
            "Focus on maintaining proper form despite fatigue.",
            "Maintain proper form to avoid injury.",
            "Stay focused on maintaining proper form despite fatigue.",
            "Focus on maintaining proper form, even when tired.",
            "Focus on maintaining proper form, even when fatigued."
        ],
        "firm": [
            "Focus on maintaining proper form despite fatigue.",
            "Focus on maintaining equal range on both sides.",
            "Maintain proper form, focus on controlled movement.",
            "Focus on maintaining consistent range of motion.",
            "Focus on maintaining consistent range of motion on both sides."
        ],
        "neutral": [
            "Focus on maintaining consistent range of motion on both sides.",
            "Maintain consistent range of motion on both sides.",
            "Focus on maintaining balanced range of motion on both sides.",
            "Focus on maintaining consistent range of motion.",
            "Focus on maintaining consistent range of motion on both sides."
        ],
        "encouraging": [
            "Great job correcting your left side range, keep up the effort!",
            "Great job! Focus on maintaining form with less energy.",
            "Good job adjusting your form on the left side!",
            "Keep up the good work, you're doing great!",
            "Great job focusing on maintaining a consistent range of motion!"
        ],
        "very encouraging": [
            "Amazing job! Just a few more, you're almost there!",
            "Great job improving your form, keep up the good work!",
            "Fantastic job pushing through, you're making great progress!",
            "Fantastic job! Let's keep that energy up!",
            "Fantastic job adjusting the left side with precision, keep it up!"
        ]
    },
    "corrected high_range right side": {
        "very firm": [
            "Focus on maintaining a consistent range of motion.",
            "Focus on maintaining proper form and range, push through fatigue.",
            "Maintain proper form with controlled movements, focus on both sides.",
            "Focus on maintaining proper form despite tiredness.",
            "Focus on maintaining a consistent range of motion."
        ],
        "firm": [
            "Focus on maintaining consistent range of motion on both sides.",
            "Focus on maintaining proper form despite fatigue.",
            "Focus on maintaining equal range of motion on both sides.",
            "Focus on maintaining proper form despite fatigue.",
            "Focus on maintaining consistent range of motion throughout."
        ],
        "neutral": [
            "Focus on maintaining consistent range of motion on both sides.",
            "Watch your range of motion, focus on form.",
            "Remember to focus on maintaining proper form during the curls.",
            "Focus on maintaining equal range on both sides.",
            "Focus on maintaining consistent range of motion on both sides."
        ],
        "encouraging": [
            "You're doing great, just a few more reps to go!",
            "You're doing great, focus on maintaining form and energy!",
            "Fantastic job maintaining good form throughout the exercise! Great job!",
            "Great job adjusting your range! Keep it up!",
            "Great job adjusting the range of motion! Keep it up!"
        ],
        "very encouraging": [
            "You're doing fantastic, let's focus on consistency and form!",
            "You're doing fantastic, keep pushing through with determination!",
            "You're doing fantastic! Focus on maintaining correct form.",
            "Amazing job! Just a few more reps to go!",
            "You're making amazing progress, keep up the good work!"
        ]
    },
    "corrected high_range both sides": {
        "very firm": [
            "Focus on maintaining proper form despite fatigue.",
            "Maintain proper form despite fatigue; focus on controlled movements.",
            "Maintain proper form to avoid shoulder strain.",
            "Focus on maintaining correct range even when fatigued.",
            "Focus on maintaining proper form, even when tired."
        ],
        "firm": [
            "Focus on maintaining proper form and control through fatigue.",
            "Focus on maintaining proper form, even when tired.",
            "Focus on maintaining correct form despite fatigue.",
            "Focus on maintaining proper form despite tiredness.",
            "Focus on maintaining proper form with controlled movement."
        ],
        "neutral": [
            "Focus on maintaining proper form with controlled movements.",
            "Remember to maintain proper form as you continue.",
            "Focus on maintaining correct form with controlled movements.",
            "Focus on maintaining a consistent range of motion.",
            "Focus on maintaining consistent range of motion."
        ],
        "encouraging": [
            "You're making progress, focus on maintaining proper form.",
            "You're doing great, focus on maintaining the range now.",
            "You're doing great, focus on maintaining form and pace.",
            "Awesome job improving your range of motion on both sides!",
            "Awesome job on those bicep curls, keep it up!"
        ],
        "very encouraging": [
            "Amazing progress! Keep pushing through, you're almost there!",
            "Fantastic job on those bicep curls, you're so close!",
            "You're doing fantastic, keep up the amazing work!",
            "You're doing great, keep pushing through the fatigue!",
            "You're making great progress, keep up the fantastic work!"
        ]
    },
    "fast": {
        "very firm": [
            "Focus on maintaining proper form for effective results.",
            "Focus on maintaining proper form despite fatigue.",
            "Focus on maintaining proper form throughout the entire set.",
            "Focus on maintaining proper form and tempo, push through fatigue.",
            "Focus on maintaining proper form, push through the fatigue."
        ],
        "firm": [
            "Focus on maintaining proper form throughout the entire set.",
            "Focus on your form to maintain a steady pace.",
            "Focus on keeping a steady pace and full range.",
            "Push through the fatigue, maintain proper form and speed.",
            "Maintain consistent speed throughout all repetitions for better form."
        ],
        "neutral": [
            "Focus on maintaining a consistent pace throughout the exercise.",
            "Focus on maintaining a consistent speed throughout the exercise.",
            "Focus on maintaining a steady pace for each repetition.",
            "Let's focus on maintaining a steady pace for each repetition.",
            "Focus on maintaining proper form throughout each repetition."
        ],
        "encouraging": [
            "You're doing great, just keep pushing through!",
            "You're pushing through, keep up the good work!",
            "Good job, keep pushing through with those bicep curls!",
            "You're doing great, keep up the good work!",
            "You're doing great, just a few more to go!"
        ],
        "very encouraging": [
            "You're doing great, just a few more reps to go!",
            "Fantastic work, keep pushing through with that positive energy!",
            "You're doing fantastic, just a little slower next time!",
            "You're doing great, keep pushing through with determination!",
            "You're doing fantastic! Just a few more reps to go!"
        ]
    },
    "slow": {
        "very firm": [
            "Control your speed and focus on form despite fatigue.",
            "Control the speed to maintain proper form.",
            "Control the speed, focus on form, push through the fatigue.",
            "Control the speed for better form.",
            "Control your speed for proper form and safety."
        ],
        "firm": [
            "Control your speed to maintain proper form.",
            "Control the speed to maintain proper form throughout.",
            "Slow down to maintain proper form and prevent injury.",
            "Control your pace for better form, focus on technique.",
            "Control the speed to maintain proper form, focus on technique."
        ],
        "neutral": [
            "Focus on maintaining a consistent speed throughout each repetition.",
            "Focus on maintaining a consistent pace for better form.",
            "Maintain a consistent tempo for better form.",
            "Focus on maintaining proper form, pace yourself for consistency.",
            "Focus on maintaining a consistent pace for each repetition."
        ],
        "encouraging": [
            "You're doing great, just pace yourself for better form.",
            "Nice work, keep up the good effort!",
            "You're doing well, just pace yourself for better form.",
            "Awesome job, stay focused and control the pace.",
            "You're doing great, let's focus on form for safety."
        ],
        "very encouraging": [
            "You're rocking those bicep curls, just pace yourself!",
            "Awesome job! Remember to keep a steady pace.",
            "You're doing amazing, just focus on the form a bit!",
            "You're doing amazing! Keep up the good work!",
            "Amazing job! Remember to pace yourself for each repetition."
        ]
    },
    "corrected fast": {
        "very firm": [
            "Control the movement and maintain proper form, focus now.",
            "Control the speed for better form, focus on technique.",
            "Control the movement, focus on form to avoid injury.",
            "Slow down the movement to maintain proper form.",
            "Control your speed, focus on form despite fatigue."
        ],
        "firm": [
            "Slow down for better control and form.",
            "Control the speed for better form, you're almost there.",
            "Control the pace to maintain proper form, push through fatigue.",
            "Control the speed to avoid jerking the movement.",
            "Slow down the pace to maintain control and form."
        ],
        "neutral": [
            "Focus on maintaining a controlled pace to avoid fatigue.",
            "Focus on maintaining a controlled pace for better form.",
            "Focus on maintaining a consistent pace throughout the exercise.",
            "Focus on controlling the speed for better form.",
            "Focus on maintaining a controlled pace for better form."
        ],
        "encouraging": [
            "You're doing great; pace yourself to prevent fatigue.",
            "You're doing great, just remember to control the speed.",
            "Nice work adjusting your pace, keep it up!",
            "Awesome work! Focus on form, keep it up!",
            "Nice job on correcting your speed, you're doing great!"
        ],
        "very encouraging": [
            "You're doing fantastic, push through the fatigue with determination!",
            "You're doing fantastic, just a few more to go!",
            "Awesome job adjusting your pace, keep it up!",
            "Fantastic job, keep up the amazing work!",
            "You're doing fantastic, just remember to control the pace!"
        ]
    },
    "corrected slow": {
        "very firm": [
            "Pick up the pace, maintain proper form.",
            "Pick up the pace and maintain proper form.",
            "Speed up the curl and maintain proper form.",
            "Pick up the pace and maintain proper form, focus up.",
            "Pick up the pace and maintain proper form."
        ],
        "firm": [
            "Focus on maintaining a consistent pace.",
            "Speed up the bicep curls.",
            "Pick up the pace a bit to maintain form and control.",
            "Focus on maintaining a consistent pace to complete reps effectively.",
            "Pick up the pace a bit on the next repetition."
        ],
        "neutral": [
            "Remember to maintain a steady pace throughout the exercise.",
            "Maintain a steady pace to avoid going too slow again.",
            "Maintain a steady pace for better form and efficiency.",
            "Focus on maintaining a consistent pace to avoid strain.",
            "Maintain a consistent pace to avoid fatigue."
        ],
        "encouraging": [
            "You're doing great, keep up the good work!",
            "Awesome job pushing through, keep it up!",
            "You're doing great, just a few more reps to go!",
            "You're doing great, just one more set to go!",
            "You're getting stronger with each rep, keep it up!"
        ],
        "very encouraging": [
            "You're doing great! Push through, you're unstoppable!",
            "You're doing fantastic! Just a few more reps to go!",
            "You're doing great! Keep pushing through, you've got this!",
            "You're doing amazing! Keep up the awesome work!",
            "You're doing great! Just a few more reps to go!"
        ]
    },
    "good speed": {
        "very firm": [
            "Focus on maintaining proper form despite fatigue.",
            "Focus on maintaining proper form despite feeling tired.",
            "Focus on maintaining proper form despite feeling tired.",
            "Focus on form, slow down to prevent injury.",
            "Stay focused and maintain proper form despite fatigue."
        ],
        "firm": [
            "Focus on maintaining good form despite feeling fatigued.",
            "Focus on maintaining proper form despite fatigue.",
            "Focus on maintaining proper form to prevent injury.",
            "Focus on maintaining proper form despite fatigue.",
            "Focus on maintaining proper form and control."
        ],
        "neutral": [
            "Focus on maintaining proper form to prevent injury.",
            "Focus on maintaining proper form as you continue.",
            "Remember to focus on maintaining proper form even when tired.",
            "Maintain proper form to prevent injury.",
            "Maintain good form and focus on breathing during the movement."
        ],
        "encouraging": [
            "Great work, you're showing impressive progress!",
            "You're doing great, just a few more to go!",
            "You're doing great, keep up the strong work!",
            "Fantastic job, nice control with good speed!",
            "Awesome work, keep up the strong effort!"
        ],
        "very encouraging": [
            "Fantastic job! Keep pushing through, you're doing amazing!",
            "You're doing fantastic, keep up the amazing work!",
            "Amazing work! Push through, you're almost there!",
            "Fantastic work! You're crushing those curls, keep it up!",
            "Fantastic work! Just a few more reps to go!"
        ]
    }
}