{
    "low_range left side": {
        "very firm": [
            "Focus on maintaining full range on both sides.",
            "Focus on maintaining full range of motion on both sides.",
            "Focus on increasing the left side's range of motion.",
            "Focus on improving left side range, push through fatigue.",
            "Focus on improving left side range."
        ],
        "firm": [
            "Focus on maintaining full range on the left side.",
            "Focus on maintaining full range on both sides.",
            "Focus on maintaining full range on both sides next time.",
            "Focus on increasing the range on the left side.",
            "Focus on better range on the left side."
        ],
        "neutral": [
            "Focus on maintaining equal range of motion on both sides.",
            "Focus on maintaining even range on both sides next time.",
            "Focus on maintaining consistent range of motion on both sides.",
            "Focus on maintaining consistent range on both sides.",
            "Focus on maintaining equal range of motion on both sides."
        ],
        "encouraging": [
            "Nice work, focus on improving left side technique next time.",
            "Great job! Let's focus on left side range next.",
            "Nice work, focus on maintaining full range of motion!",
            "Well done! Focus on maintaining form and push through.",
            "Great job pushing through, focus on left side range next!"
        ],
        "very encouraging": [
            "You're doing amazing, keep pushing through the fatigue!",
            "Amazing work! Let's push through the fatigue together!",
            "Great job pushing through, you're getting stronger every day!",
            "Awesome job pushing through, keep up the great work!",
            "Fantastic job! Let's aim for a little higher next time!"
        ]
    },
    "low_range right side": {
        "very firm": [
            "Focus on improving the range on the right side.",
            "Focus on improving the range on your right side.",
            "Focus on improving the right side's range, push through fatigue.",
            "Focus on proper form for better range.",
            "Focus on improving the range on your right side."
        ],
        "firm": [
            "Focus on improving the right side's range next time.",
            "Focus on increasing range on the right side, push through fatigue.",
            "Focus on improving range on the right side.",
            "Focus on improving the range on your right side.",
            "Focus on improving the range on your right side."
        ],
        "neutral": [
            "Focus on equal range on both sides next time.",
            "Focus on equal range on both sides next time.",
            "Focus on balancing both sides for better form.",
            "Let's focus on maintaining consistent range of motion.",
            "Focus on improving the range on the right side."
        ],
        "encouraging": [
            "Well done! Let's focus on improving the right side.",
            "Great work on the left side, focus on form on right.",
            "Amazing effort! Focus on evening out both sides evenly.",
            "Good job staying focused, let's aim for symmetry next time!",
            "Great job staying consistent, focus on right side's range next."
        ],
        "very encouraging": [
            "You're doing fantastic, keep up the great work!",
            "Amazing effort! Let's aim for even more next time!",
            "You're doing amazing, keep up the good work!",
            "You're doing amazing, keep pushing through with those raises!",
            "You're doing fantastic, keep up the amazing work!"
        ]
    },
    "low_range both sides": {
        "very firm": [
            "Focus on maintaining full range, push through fatigue.",
            "Focus on full range of motion, push through fatigue.",
            "Focus on full range next time. Keep pushing yourself!",
            "Focus on full range of motion, push through the fatigue.",
            "Focus on maintaining full range of motion despite fatigue."
        ],
        "firm": [
            "Focus on improving range of motion on both sides.",
            "Focus on maintaining full range of motion next time.",
            "Focus on improving your range of motion next time.",
            "Focus on maintaining proper form for more effective results.",
            "Focus on maintaining proper range of motion next time."
        ],
        "neutral": [
            "Focus on maintaining consistent range of motion on both sides.",
            "Focus on maintaining proper form for better range next time.",
            "Focus on maintaining the full range of motion.",
            "Focus on maintaining full range of motion.",
            "Focus on improving range of motion on lateral raises."
        ],
        "encouraging": [
            "Good job pushing through, focus on full range of motion.",
            "Amazing job, push through the fatigue next time!",
            "Great job, push through the fatigue for better form!",
            "Fantastic effort! Let's focus on maintaining that range.",
            "Great work! Push through, focus on form."
        ],
        "very encouraging": [
            "You're making great progress, push through the fatigue!",
            "You're doing amazing, keep up the great work!",
            "You're doing fantastic, keep up the amazing work!",
            "Great work! Push through the fatigue, you've got this!",
            "You're almost there! Rest a bit and continue strong!"
        ]
    },
    "bad left side": {
        "very firm": [
            "Focus on maintaining proper form on both sides.",
            "Focus on maintaining proper form, even when fatigued.",
            "Focus on form: Correct left side alignment, avoid shoulder shrug.",
            "Focus on maintaining proper form despite fatigue.",
            "Focus on maintaining proper form on both sides next time."
        ],
        "firm": [
            "Focus on proper form to prevent injury.",
            "Focus on maintaining proper form on both sides.",
            "Focus on maintaining form on your left side.",
            "Focus on maintaining proper form, especially on the left side.",
            "Focus on keeping both sides in proper form."
        ],
        "neutral": [
            "Focus on maintaining proper form to prevent injury.",
            "Focus on maintaining proper form to prevent injury.",
            "Focus on maintaining proper form on both sides next time.",
            "Focus on maintaining proper form despite fatigue.",
            "Focus on maintaining good form on both sides."
        ],
        "encouraging": [
            "You're almost there! Focus on form for each rep.",
            "Great job pushing through, focus on form next time.",
            "Great job on the right side, focus on form!",
            "Great job pushing through, focus on form next time!",
            "Great job pushing through fatigue, focus on left form!"
        ],
        "very encouraging": [
            "Awesome work! Keep pushing through the fatigue!",
            "Amazing job! Just a little more on the left side!",
            "Keep pushing, you're a rockstar!",
            "You're doing amazing, keep pushing through the fatigue!",
            "Fantastic job, keep pushing through with those lateral raises!"
        ]
    },
    "bad right side": {
        "very firm": [
            "Focus on maintaining proper form on the right side.",
            "Focus on proper form for both sides, push through fatigue.",
            "Focus on maintaining proper form on the right side.",
            "Focus on maintaining proper form, even when fatigued.",
            "Focus on maintaining proper form on the right side."
        ],
        "firm": [
            "Focus on keeping proper form, especially on the right side.",
            "Focus on maintaining proper form on the right side.",
            "Focus on maintaining proper form on the right side.",
            "Focus on maintaining proper form on the right side.",
            "Focus on maintaining proper form, especially on the right side."
        ],
        "neutral": [
            "Focus on maintaining good form on both sides.",
            "Focus on maintaining proper form on both sides.",
            "Focus on maintaining proper form on both sides next time.",
            "Focus on maintaining symmetry in shoulder movement.",
            "Focus on maintaining form on the right side."
        ],
        "encouraging": [
            "Great job on the left side! Let's work on the right!",
            "Great job on the left side, focus on form for right!",
            "Nice work! Let's focus on form for both sides.",
            "Nice job with your left side, focus on form now!",
            "Great job on the left side, focus on form for right."
        ],
        "very encouraging": [
            "Great job on the left side! Keep pushing through!",
            "Fantastic job on the left side, keep up the good work!",
            "Great job on the left side, let's match that form!",
            "You're doing a fantastic job, keep up the hard work!",
            "Amazing job! Focus on form, you're almost there!"
        ]
    },
    "bad both sides": {
        "very firm": [
            "Focus on maintaining proper form, push through the fatigue.",
            "Focus on maintaining proper form despite fatigue.",
            "Focus on maintaining proper form, even when fatigued.",
            "Focus on maintaining proper form, even when tired.",
            "Focus on form to prevent injury. Keep shoulders stable."
        ],
        "firm": [
            "Focus on maintaining proper form to prevent injuries.",
            "Focus on form, maintain control even when fatigued.",
            "Focus on proper form and control, even when fatigued.",
            "Focus on form to prevent injury, stay strong.",
            "Focus on maintaining proper form, even when fatigued."
        ],
        "neutral": [
            "Focus on maintaining proper form to avoid injury.",
            "Focus on maintaining proper form to prevent injury.",
            "Focus on maintaining proper form throughout the exercise.",
            "Focus on form to prevent injury.",
            "Focus on form, ensure stability during lateral raises."
        ],
        "encouraging": [
            "You're pushing through fatigue, keep it up!",
            "You're almost there! Focus on form for better results.",
            "You're doing great, remember to engage your core too!",
            "You're almost there, keep up the good work!",
            "Great work, focus on slowing down for better form."
        ],
        "very encouraging": [
            "You're doing fantastic, keep up the great work!",
            "You're doing amazing, just a few more to go!",
            "Great job pushing through, remember to maintain good form!",
            "You're putting in great work, keep it up!",
            "Great job pushing through! You've got this!"
        ]
    },
    "corrected low_range left side": {
        "very firm": [
            "Maintain full range of motion on both sides.",
            "Maintain proper range of motion, focus on form.",
            "Focus on maintaining proper form, push through the fatigue.",
            "Focus on maintaining proper range on the left side.",
            "Ensure full range of motion for optimal benefit."
        ],
        "firm": [
            "Focus on maintaining proper range despite fatigue.",
            "Focus on maintaining full range of motion on each side.",
            "Focus on maintaining proper range of motion on both sides.",
            "Focus on maintaining full range for effective exercise.",
            "Focus on full range for balanced strength."
        ],
        "neutral": [
            "Focus on maintaining proper form to prevent injury.",
            "Focus on maintaining a consistent range of motion.",
            "Focus on maintaining consistent range of motion on both sides.",
            "Focus on maintaining consistent range of motion on both sides.",
            "Focus on maintaining equal range of motion on both sides."
        ],
        "encouraging": [
            "Nice correction on the left side, stay strong!",
            "You're doing great, focus on maintaining the range.",
            "Well done! Pay attention to full range of motion.",
            "You're doing a fantastic job, push through the fatigue!",
            "Great job correcting your range of motion, keep pushing through!"
        ],
        "very encouraging": [
            "You're doing fantastic, push through the tiredness!",
            "Fantastic job so far! Keep up the amazing work!",
            "You're doing amazing, keep up the fantastic work!",
            "Fantastic job pushing through, you're almost there!",
            "Fantastic job! Push through the fatigue, you're almost there!"
        ]
    },
    "corrected low_range right side": {
        "very firm": [
            "Focus on maintaining full range of motion on both sides.",
            "Focus on maintaining full range of motion.",
            "Focus on maintaining equal range on both sides.",
            "Focus on maintaining proper range even when fatigued.",
            "Push through the fatigue and maintain proper form."
        ],
        "firm": [
            "Focus on maintaining full range of motion on both sides.",
            "Maintain full range of motion to maximize benefits.",
            "Focus on maintaining full range of motion on both sides.",
            "Focus on full range to ensure balanced strength development.",
            "Focus on maintaining proper range of motion despite fatigue."
        ],
        "neutral": [
            "Focus on maintaining consistent range of motion on both sides.",
            "Focus on maintaining consistent range of motion on both sides.",
            "Focus on maintaining proper range of motion.",
            "Focus on maintaining consistent range of motion on both sides.",
            "Focus on maintaining proper form to prevent injury."
        ],
        "encouraging": [
            "Great job adjusting your range of motion, keep it up!",
            "You're almost there! Keep pushing through the fatigue!",
            "Good job pushing through, I see your effort!",
            "You're doing great, focus on keeping both arms level.",
            "Awesome job! Focus on maintaining good form."
        ],
        "very encouraging": [
            "Fantastic work! You're making great progress!",
            "You're doing fantastic, keep up the good work!",
            "Amazing effort! Stay strong, you're doing fantastic!",
            "Amazing job! Push through the fatigue with determination.",
            "Well done! Keep pushing through, you're almost there!"
        ]
    },
    "corrected low_range both sides": {
        "very firm": [
            "Focus on maintaining proper form for full range of motion.",
            "Focus on maintaining full range of motion next time.",
            "Focus on maintaining proper range of motion despite fatigue.",
            "Focus on maintaining full range of motion and push through.",
            "Focus on maintaining proper range to avoid injury."
        ],
        "firm": [
            "Focus on maintaining full range of motion despite fatigue.",
            "Focus on maintaining full range of motion on each rep.",
            "Focus on maintaining full range of motion on each side.",
            "Remember to maintain full range of motion on both sides.",
            "Focus on maintaining proper range of motion despite fatigue."
        ],
        "neutral": [
            "Focus on maintaining a consistent range of motion on both sides.",
            "Focus on maintaining proper form for better results.",
            "Focus on maintaining full range to prevent injury.",
            "Focus on maintaining proper range of motion on both sides.",
            "Focus on maintaining a consistent range of motion."
        ],
        "encouraging": [
            "You're doing a great job, just a few more reps!",
            "Nice job pushing through, focus on full range next time!",
            "Awesome job! Focus on maintaining full range of motion.",
            "Great job improving your range on those lateral raises!",
            "Great job adjusting for better range, keep up the good work!"
        ],
        "very encouraging": [
            "You're getting stronger with every rep! Keep up the progress!",
            "You're doing amazing! Keep pushing through, you've got this!",
            "You're doing amazing, even with fatigue creeping in!",
            "Fantastic effort! Push through the fatigue, you've got this!",
            "You're doing fantastic, keep pushing through the fatigue!"
        ]
    },
    "corrected bad right side": {
        "very firm": [
            "Focus on maintaining proper form despite fatigue.",
            "Focus on maintaining proper form despite fatigue.",
            "Focus on maintaining proper form to avoid injury.",
            "Focus on maintaining proper form despite fatigue.",
            "Focus on maintaining proper form even when fatigued."
        ],
        "firm": [
            "Focus on keeping both arms at the same level.",
            "Focus on keeping both arms parallel to the ground.",
            "Correct the form on your left side to prevent injury.",
            "Focus on maintaining proper form despite fatigue.",
            "Focus on maintaining proper form, even when fatigued."
        ],
        "neutral": [
            "Focus on maintaining proper form for both sides.",
            "Focus on maintaining proper form despite fatigue.",
            "Focus on maintaining proper form despite fatigue.",
            "Focus on maintaining proper form to prevent injury.",
            "Focus on maintaining proper form despite fatigue."
        ],
        "encouraging": [
            "You're making progress, stay focused on form.",
            "You corrected the mistake on the left side, great job!",
            "Fantastic job! Keep up the hard work!",
            "Great job adjusting your form on the left side!",
            "You're doing great, stay focused on form."
        ],
        "very encouraging": [
            "Amazing job! Remember to keep that form perfect.",
            "Fantastic work! You're getting stronger with each rep!",
            "Amazing work, keep pushing through the fatigue!",
            "Awesome work on that correction, keep up the fantastic effort!",
            "Fantastic job pushing through, you're unstoppable!"
        ]
    },
    "corrected bad left side": {
        "very firm": [
            "Focus on maintaining proper form despite fatigue.",
            "Focus on keeping both arms at the same level.",
            "Focus on maintaining proper form to prevent injury.",
            "Focus on maintaining proper form to prevent injury.",
            "Focus on your form despite feeling tired."
        ],
        "firm": [
            "Focus on maintaining proper form despite fatigue.",
            "Focus on maintaining proper form, even when fatigued.",
            "Focus on maintaining proper form despite being fatigued.",
            "Watch your form, tighten your core for stability.",
            "Focus on maintaining proper form, push through the fatigue."
        ],
        "neutral": [
            "Focus on maintaining proper form throughout each repetition.",
            "Focus on maintaining proper form on both sides equally.",
            "Focus on maintaining proper form and pace.",
            "Focus on maintaining proper form throughout the exercise.",
            "Focus on maintaining proper form despite fatigue."
        ],
        "encouraging": [
            "You're doing great, just a few more!",
            "Nice work! Focus on form, you're almost there.",
            "You're almost there, push through the fatigue!",
            "You're almost there, just a few more reps to go!",
            "Nice work! Keep pushing through the fatigue."
        ],
        "very encouraging": [
            "You're doing great, keep pushing through!",
            "You're doing so well, keep up the amazing work!",
            "You're working hard, keep pushing through!",
            "You're doing fantastic, keep pushing through the fatigue!",
            "You're doing fantastic, keep pushing through the fatigue!"
        ]
    },
    "corrected bad both sides": {
        "very firm": [
            "Focus on maintaining proper form despite fatigue.",
            "Focus on maintaining proper form despite fatigue.",
            "Focus on form even when tired.",
            "Focus on proper form even when tired. Fix mistakes.",
            "Focus on proper form, push through fatigue."
        ],
        "firm": [
            "Focus on proper form to prevent injury.",
            "Focus on controlling the movement, even when fatigued.",
            "Focus on maintaining proper form despite fatigue.",
            "Focus on maintaining proper form despite fatigue.",
            "Focus on proper form, even when fatigued."
        ],
        "neutral": [
            "Focus on maintaining proper form even when fatigued.",
            "Focus on maintaining proper form to prevent injuries.",
            "Focus on keeping the movement controlled and smooth.",
            "Remember to keep your shoulders relaxed throughout the movement.",
            "Focus on maintaining proper form, especially when fatigued."
        ],
        "encouraging": [
            "Great work on those lateral raises, you're almost there!",
            "Keep up the good work, you're almost there!",
            "You're doing great, keep pushing through the fatigue!",
            "Nice work! Focus on keeping your arms parallel.",
            "Well done! Corrected form, keep pushing through the fatigue."
        ],
        "very encouraging": [
            "You're pushing through fatigue like a champion, keep it up!",
            "Amazing work! Push through, you're almost there!",
            "Fantastic job pushing through! Your hard work is paying off!",
            "Way to catch and correct those form mistakes! You're amazing!",
            "You're doing great! Keep up the fantastic work!"
        ]
    },
    "good form": {
        "very firm": [
            "Focus on maintaining proper form despite fatigue.",
            "Focus on keeping proper form despite fatigue.",
            "Focus on controlling the movement despite fatigue.",
            "Focus on maintaining proper form, push through the fatigue.",
            "Focus on form, push through fatigue for proper alignment."
        ],
        "firm": [
            "Focus on maintaining proper form despite fatigue.",
            "Stay focused, control the movement to prevent swinging.",
            "Focus on maintaining proper form despite fatigue.",
            "Focus on maintaining proper form despite fatigue.",
            "Focus on maintaining proper form, push through the fatigue."
        ],
        "neutral": [
            "Remember to focus on maintaining proper form.",
            "Maintain good form and listen to your body's limits.",
            "Focus on keeping steady pace and controlled form.",
            "Focus on maintaining good form despite fatigue.",
            "Focus on maintaining good form as you continue."
        ],
        "encouraging": [
            "Fantastic work on those lateral raises, you're almost there!",
            "Great job on that last repetition, you're doing fantastic!",
            "Well done! You're getting stronger with each rep!",
            "Great job on that last repetition, you're almost there!",
            "Amazing job on that last repetition, keep up the good work!"
        ],
        "very encouraging": [
            "Fantastic work! Your last repetition was fantastic. Keep it up!",
            "You're doing an amazing job, keep pushing through!",
            "You're crushing it today, keep up the amazing work!",
            "You're crushing it! Just a few more, you've got this!",
            "You're doing fantastic, keep up the amazing work!"
        ]
    },
    "high_range left side": {
        "very firm": [
            "Focus on controlled movements to avoid overextending in the future.",
            "Control the range of motion, focus on form.",
            "Focus on maintaining a controlled range of motion.",
            "Focus on maintaining proper form even when fatigued.",
            "Focus on maintaining proper form for safer movements."
        ],
        "firm": [
            "Control the left side's range better next time.",
            "Focus on maintaining proper form, even when fatigued.",
            "Focus on maintaining proper form to avoid overextending.",
            "Focus on maintaining proper range of motion next time.",
            "Focus on maintaining proper range of motion on both sides."
        ],
        "neutral": [
            "Focus on maintaining consistent range of motion.",
            "Pay attention to maintaining a consistent range of motion.",
            "Focus on maintaining consistent range of motion for both sides.",
            "Focus on maintaining a consistent range of motion on both sides.",
            "Focus on maintaining consistent range of motion on both sides."
        ],
        "encouraging": [
            "Well done! Focus on maintaining the proper range next time.",
            "Good job, focus on technique for the left side.",
            "Nice work, focus on maintaining proper form next time!",
            "You're doing great, focus on quality over quantity!",
            "You're doing great, just focus on keeping that range controlled."
        ],
        "very encouraging": [
            "You're pushing through fatigue with incredible determination, well done!",
            "Great job pushing through, your hard work is paying off!",
            "Amazing effort! Push through the fatigue, you're almost there!",
            "Fantastic work! Push through and maintain that amazing effort!",
            "You're powering through! Let's focus on form next time."
        ]
    },
    "high_range right side": {
        "very firm": [
            "Focus on proper form, control the range of motion.",
            "Control your motion to prevent overexertion and maintain form.",
            "Focus on maintaining proper range even when fatigued.",
            "Maintain proper form to prevent injury.",
            "Focus on maintaining proper form, even when fatigued."
        ],
        "firm": [
            "Focus on maintaining proper range of motion next time.",
            "Focus on maintaining proper range of motion on right side.",
            "Focus on maintaining proper form to prevent injury.",
            "Focus on maintaining proper form for better outcomes.",
            "Focus on maintaining proper range of motion next time."
        ],
        "neutral": [
            "Focus on maintaining consistent range of motion on both sides.",
            "Focus on maintaining consistent range of motion on both sides.",
            "Focus on maintaining a consistent range of motion next time.",
            "Maintain a controlled range of motion, watch fatigue levels.",
            "Focus on maintaining proper range of motion for balance."
        ],
        "encouraging": [
            "You're almost there! Focus on keeping the motion controlled.",
            "You're doing a fantastic job, just watch that form!",
            "Great job pushing through, focus on form next time!",
            "Great work! Focus on maintaining form for better results.",
            "Awesome work! Focus on keeping the range controlled."
        ],
        "very encouraging": [
            "Amazing work, push through fatigue and maintain form!",
            "You're doing fantastic, let's aim for perfect form next time!",
            "You're doing great, keep pushing through the fatigue!",
            "You're doing great! Push through, you've got this!",
            "Fantastic job, keep up the excellent work!"
        ]
    },
    "high_range both sides": {
        "very firm": [
            "Control the range to avoid overextending when fatigued.",
            "Focus on maintaining proper form despite fatigue.",
            "Focus on maintaining proper form even when fatigued.",
            "Focus on controlled movements, maintain ideal range next time.",
            "Focus on controlling your range of motion more tightly."
        ],
        "firm": [
            "Focus on maintaining proper form despite fatigue.",
            "Focus on controlled movements, reduce range for proper form.",
            "Focus on controlled movement for better form.",
            "Focus on maintaining proper form despite fatigue.",
            "Focus on controlling the range of motion, avoid overextending."
        ],
        "neutral": [
            "Maintain control to prevent overextending during lateral raises.",
            "Maintain a consistent range of motion on both sides.",
            "Focus on maintaining a consistent range of motion.",
            "Focus on maintaining a consistent range of motion.",
            "Focus on maintaining a controlled range of motion."
        ],
        "encouraging": [
            "You're doing really well, just focus on better control.",
            "Great work! Focus on quality over quantity.",
            "Awesome work! Focus on maintaining proper form next time.",
            "You're doing great! Just a bit more focus on form.",
            "Good job, focus on maintaining proper form next time."
        ],
        "very encouraging": [
            "Fantastic job pushing through, let's focus on form next time!",
            "You're doing fantastic! Let's aim for perfect form next.",
            "Amazing work! Push through, you're almost there!",
            "Great job pushing through, you're amazing!",
            "You're pushing through fatigue; amazing job, keep it up!"
        ]
    },
    "corrected high_range left side": {
        "very firm": [
            "Focus and maintain proper form, even when fatigued.",
            "Be mindful of maintaining equal range on both sides.",
            "Focus on maintaining proper form despite fatigue.",
            "Focus on maintaining proper form despite fatigue.",
            "Focus on maintaining proper form despite fatigue."
        ],
        "firm": [
            "Control your range of motion to prevent injury.",
            "Focus on maintaining proper range of motion on both sides.",
            "Focus on proper form even when fatigued.",
            "Focus on maintaining proper form despite fatigue.",
            "Focus on maintaining proper form despite fatigue."
        ],
        "neutral": [
            "Focus on maintaining consistent range of motion on both sides.",
            "Remember to maintain equal range of motion on both sides.",
            "Focus on balancing the range of motion for each side.",
            "Focus on maintaining consistent range of motion on both sides.",
            "Focus on maintaining a consistent range of motion."
        ],
        "encouraging": [
            "You're making excellent progress, keep it up!",
            "You're almost there, keep up the good work!",
            "Fantastic job on correcting the range of motion! Keep pushing!",
            "Nice correction! Keep up the good work!",
            "Nice work adjusting your range, keep up the good work!"
        ],
        "very encouraging": [
            "Amazing job on those lateral raises! Rest well after this.",
            "Amazing job adjusting your range! Keep up the good work!",
            "You're doing fantastic, keep pushing through the fatigue!",
            "Amazing job! Keep up the fantastic work!",
            "You're doing fantastic, even with fatigue! Keep it up!"
        ]
    },
    "corrected high_range right side": {
        "very firm": [
            "Focus on maintaining proper form even when tired.",
            "Focus on maintaining proper form even when fatigued.",
            "Focus on maintaining proper range of motion, even when fatigued.",
            "Maintain proper form, focus on control despite fatigue.",
            "Focus on maintaining proper range of motion on both sides."
        ],
        "firm": [
            "Maintain proper form to prevent injury.",
            "Focus on maintaining proper form and controlled movement technique.",
            "Focus on maintaining proper range of motion on both sides.",
            "Focus on maintaining proper form despite fatigue.",
            "Focus on maintaining proper form despite fatigue."
        ],
        "neutral": [
            "Focus on maintaining equal range of motion on both sides.",
            "Focus on maintaining consistent range.",
            "Focus on keeping both sides at the same level.",
            "Focus on maintaining consistent range of motion bilaterally.",
            "Focus on maintaining a consistent range of motion."
        ],
        "encouraging": [
            "Good job on focusing on correcting the range of motion!",
            "Great job pushing through, you're almost there!",
            "You're doing great, focus on maintaining proper form.",
            "You're doing great, just a few more to go!",
            "You're almost there, keep up the good work!"
        ],
        "very encouraging": [
            "You're doing fantastic, keep up the excellent work!",
            "Fantastic job on that correction! Keep up the great work!",
            "Amazing work! Push through, you're almost there!",
            "Amazing job pushing through, you're almost there!",
            "You're doing great! Just a few more reps to go!"
        ]
    },
    "corrected high_range both sides": {
        "very firm": [
            "Maintain proper form even when fatigued, focus on control.",
            "Focus on maintaining proper form despite fatigue.",
            "Focus on proper form, maintain lower range next time.",
            "Focus on maintaining proper form despite fatigue.",
            "Maintain proper form, focus on controlled movement."
        ],
        "firm": [
            "Maintain proper form; control the range of motion.",
            "Focus on maintaining the correct form, even when fatigued.",
            "Focus on maintaining proper form despite fatigue.",
            "Focus on maintaining proper form despite fatigue.",
            "Focus on maintaining proper form despite fatigue."
        ],
        "neutral": [
            "Focus on maintaining a consistent range of motion.",
            "Focus on maintaining a consistent range of motion.",
            "Maintain proper form with slightly lower range of motion.",
            "Focus on maintaining consistent range of motion.",
            "Focus on maintaining consistent range of motion on both sides."
        ],
        "encouraging": [
            "You're doing great, focus on maintaining proper form.",
            "Great job adjusting your range of motion, you're getting stronger!",
            "Good job, remember to keep up the excellent form!",
            "Awesome job maintaining proper form, keep up the good work!",
            "Great job on those lateral raises, keep up the effort!"
        ],
        "very encouraging": [
            "You're doing fantastic, keep up the amazing work!",
            "Fantastic job! Keep up the amazing work!",
            "Fantastic job pushing through fatigue! Keep up the awesome work!",
            "You're doing amazing! Keep up the hard work!",
            "Amazing work! Let's finish strong together!"
        ]
    },
    "fast": {
        "very firm": [
            "Focus on proper form for better results.",
            "Focus on maintaining proper form despite fatigue.",
            "Focus on maintaining proper form through the entire movement.",
            "Focus on maintaining proper form to prevent injury.",
            "Focus on maintaining a steady pace despite fatigue."
        ],
        "firm": [
            "Maintain proper form and focus for better performance.",
            "Maintain proper form even when fatigued.",
            "Focus on maintaining proper form, even when fatigued.",
            "Focus on maintaining proper form, even when fatigued.",
            "Speed up the movement for better form."
        ],
        "neutral": [
            "Focus on maintaining a consistent pace throughout the exercise.",
            "Focus on maintaining a consistent pace to prevent fatigue.",
            "Focus on maintaining proper form despite fatigue.",
            "Focus on maintaining a consistent pace to prevent fatigue.",
            "Focus on maintaining proper form to prevent injury."
        ],
        "encouraging": [
            "Great work, remember to pace yourself with each repetition!",
            "You're doing a fantastic job, keep pushing through!",
            "Great job pushing through, remember to focus on form!",
            "You're almost there! Just a bit more for each rep.",
            "You're doing great, keep pushing through the fatigue!"
        ],
        "very encouraging": [
            "You're doing fantastic, push through the fatigue!",
            "You're doing great, keep pushing through the fatigue!",
            "You're doing great, push through with determination and strength!",
            "You're doing amazing, just a few more to go!",
            "You're doing fantastic, push through the fatigue!"
        ]
    },
    "slow": {
        "very firm": [
            "Control your pace to prevent injury.",
            "Control the speed of your repetitions to prevent injury.",
            "Control your pace to maintain proper form, focus.",
            "Control the movement, maintain proper form even when tired.",
            "Slow down to maintain proper form despite fatigue."
        ],
        "firm": [
            "Control your speed for better form, focus on control.",
            "Control the speed of your movements to prevent injury.",
            "Control the speed for better form and muscle engagement.",
            "Control your pace for better form and safety.",
            "Control your speed for better form, focus on control."
        ],
        "neutral": [
            "Focus on maintaining a consistent pace for each repetition.",
            "Remember to maintain a controlled pace during the lateral raises.",
            "Focus on maintaining proper form for effective lateral raises.",
            "Focus on maintaining proper form to prevent injury.",
            "Focus on maintaining a controlled pace to prevent injury."
        ],
        "encouraging": [
            "Well done! Remember to maintain a controlled pace.",
            "Great job pushing through, remember to pace yourself.",
            "Good job, pace yourself to avoid fatigue.",
            "You're pushing through fatigue, impressive effort!",
            "Fantastic work! Let's focus on form to avoid injury."
        ],
        "very encouraging": [
            "You're pushing through fatigue, keep up the fantastic work!",
            "You're doing amazing! Let's maintain good form.",
            "Fantastic work, just pace yourself for better control!",
            "Fantastic job, keep pushing through with determination!",
            "You're doing fantastic, let's maintain that form and pace!"
        ]
    },
    "corrected fast": {
        "very firm": [
            "Control the speed to maintain proper form.",
            "Control the movement and maintain a steady pace.",
            "Control your pace, maintain form, focus on quality.",
            "Slow down and focus on form for better results.",
            "Control your pace, focus on form to prevent injury."
        ],
        "firm": [
            "Slow down and focus on maintaining proper form.",
            "Slow down the movement to maintain proper form.",
            "Control your speed to prevent mistakes.",
            "Slow down to maintain proper form to prevent injury.",
            "Focus on maintaining proper form and control the movement."
        ],
        "neutral": [
            "Maintain control and focus on form to prevent injury.",
            "Focus on maintaining proper form to prevent injury.",
            "Focus on maintaining a controlled pace for better form.",
            "Focus on maintaining proper form through controlled movements.",
            "Focus on maintaining a consistent pace to prevent fatigue."
        ],
        "encouraging": [
            "You're doing great, remember to control the movement.",
            "You're doing great, focus on each repetition slowly.",
            "Nice job staying controlled, focus on form and pace!",
            "Fantastic job on those lateral raises, push through the fatigue!",
            "You're doing great, just a few more reps to go!"
        ],
        "very encouraging": [
            "You're doing fantastic, just a few more to go!",
            "Fantastic job! Focus on controlling the movement more smoothly.",
            "You're doing amazing with those lateral raises, keep it up!",
            "You're doing fantastic, just a few more to go!",
            "You're doing fantastic! Keep pushing through, you've got this!"
        ]
    },
    "corrected slow": {
        "very firm": [
            "Pick up the pace and maintain proper form throughout.",
            "Speed up the movement, maintain proper form throughout.",
            "Pick up the pace, maintain proper form.",
            "Increase the speed of your lateral raises to maintain form.",
            "Pick up the pace and maintain proper form."
        ],
        "firm": [
            "Speed up your lateral raises, maintain form.",
            "Maintain a controlled pace, push through the fatigue.",
            "Pick up the pace, keep a consistent speed.",
            "Speed up the movement to maintain proper form.",
            "Focus on maintaining a consistent pace despite fatigue."
        ],
        "neutral": [
            "Focus on maintaining a consistent tempo throughout the exercise.",
            "Focus on maintaining a steady pace for better form.",
            "Maintain a consistent pace to avoid muscle fatigue.",
            "Focus on maintaining proper form with a steady pace.",
            "Focus on maintaining proper form and pace."
        ],
        "encouraging": [
            "You're doing well, keep up the good work!",
            "You're doing great! Keep pushing through the fatigue.",
            "You're doing great, just a few more to go!",
            "You're almost there! Stay strong, keep up the good work.",
            "You're doing great, just a few more to go!"
        ],
        "very encouraging": [
            "Fantastic job pushing through, you're almost there!",
            "You're doing amazing, keep pushing through the fatigue!",
            "You're doing fantastic! Just a few more to go!",
            "Fantastic work! Push through the fatigue, you're almost there!",
            "You're doing fantastic, keep up the amazing work!"
        ]
    },
    "good speed": {
        "very firm": [
            "Focus on maintaining proper form despite fatigue.",
            "Focus on maintaining proper form despite fatigue.",
            "Focus on maintaining proper form despite being fatigued.",
            "Focus on maintaining proper form to avoid injury.",
            "Focus on maintaining proper form despite fatigue."
        ],
        "firm": [
            "Focus on maintaining proper form to prevent injury.",
            "Maintain proper form, focus on control.",
            "Focus on maintaining proper form despite fatigue.",
            "Focus on maintaining proper form to prevent injury.",
            "Focus on maintaining proper form despite fatigue."
        ],
        "neutral": [
            "Focus on maintaining proper form to prevent injury.",
            "Focus on maintaining proper form as you continue.",
            "Focus on maintaining proper form during each repetition.",
            "Focus on maintaining good form despite fatigue.",
            "Take a moment to catch your breath before continuing."
        ],
        "encouraging": [
            "Awesome work, push through the fatigue!",
            "Fantastic job on those lateral raises, you're almost there!",
            "Great job on those lateral raises, you're doing fantastic!",
            "You're doing amazing, keep pushing through the fatigue!",
            "You're pushing through, great work!"
        ],
        "very encouraging": [
            "Amazing job on those lateral raises, keep up the awesome work!",
            "You're crushing it, keep up the amazing work!",
            "You're doing fantastic, keep pushing through!",
            "You're doing fantastic! Push through, you've got this!",
            "Fantastic job on that last repetition, you're doing amazing!"
        ]
    }
}